{"category": "Legal Services & Government", "title": "Stress free application", "review": "Me and my wife used Sabz Solicitors throughout my wife's visa process. Alanta from sabz was our case worker who was very professional and re-assuring throughout. I Honestly couldn't recommend her expertise enough to anyone looking to take the stress away from the visa process. Thank you again Sabz and thank you again Alanta.", "stars": 5, "review_id": 118260}
{"category": "Home & Garden", "title": "A brilliant all round secvice from…", "review": "A brilliant all round secvice from start to finish. Amanda sales personnel was so helpful in helping us to select the right furniture. Delivery team with contact before delivery making sure everything would fit and actually delivery team just finished off a great secvice. ", "stars": 5, "review_id": 25434}
{"category": "Electronics & Technology", "title": "This was my first purchase from…", "review": "This was my first purchase from ceiling-speakers and I would not hesitate to use them again. I ordered a pair of wharfedale ceiling speakers and they arrived within a couple days, free delivery. The whole process was very easy, and a payment option of pay-pal even easier. The speakers are excellent too, great sound.", "stars": 5, "review_id": 33365}
{"category": "Construction & Manufacturing", "title": "Product lived up to expectations ", "review": "Product lived up to expectations and prompt delivery.", "stars": 4, "review_id": 70061}
{"category": "Home & Garden", "title": "Since being taken over", "review": "Since being taken over, delivery is poor… three times now I’ve had to chase. This time my “next day” order was split in two, both Evri and DPD confirmed, then DPD delivered and Evri said it’s an unexpectedly large parcel and they’ll have to rearrange. Complaint to Ecoblaze met with sorry but they can’t do anything. ", "stars": 1, "review_id": 120484}
{"category": "Education & Training", "title": "Disappointing wouldn’t go back", "review": "My initial review was 5 stars as I was extremely impressed I actually booked another course with them and recommended my colleagues. Mistake. I had to call them several times just to book my exam. I was told we’ll call you back on about 4 occasions and no one called. I ended up emailing them saying I would claim my money back from my credit card company then they booked my exam (still no one called me). Content of the course was good, service, appalling.", "stars": 2, "review_id": 94282}
{"category": "Hobbies & Crafts", "title": "Emma’s brushes are poorly made", "review": "I first purchased Emma’s brushes. Had an issue with one brush and after much communicating, you finally replaced it. I then ordered the bambo set. Love them. Better than Emma’s. Maybe used hers a handful of times. Now, bristles are falling out from all her brushes and each one is loose. Your one time reply was tighten with pliers.  Nice. And I only store my brushes with the bristles angled downward. POOR customer service. Won’t be supporting Craftamo again.", "stars": 2, "review_id": 15151}
{"category": "Animals & Pets", "title": "Failed to deliver", "review": "Failed to deliver ! , Watched the first Amazon chap pull into the close , he got out went to the van came out with nothing then leave , he was looking at the house and checked the number the next delivery cheap took no notice of the big note saying leave package in black box please , I know it's Amazon's fault but they are delivering your items. Order cancelled still waiting for my money to be returned .", "stars": 1, "review_id": 2724}
{"category": "Hobbies & Crafts", "title": "Blew My Mind! Excellent ", "review": "The psychic told me something hard to believe but 2 days later my love interest uttered the exact words the psychic predicted...almost word for word. It blew my mind!I have used eMystics before and things always seem to come to pass. They are better than any other online psychics. My preferred readers are: Eddie Rainha Mysti", "stars": 5, "review_id": 28674}
{"category": "Health & Medical", "title": "Unfortunately my specimen was not…", "review": "Unfortunately my specimen was not collected/delivered by your preferred supplier (Royal Mail) until after my departure date. The consequence was that I needed to pay and have another test done to enable me to fly out of the UK.I only received my results the day after I arrived back in South Africa.", "stars": 2, "review_id": 21339}
{"category": "Animals & Pets", "title": "This pet store is fantastic", "review": "This pet store is fantastic! They have a wide variety of supplies and products for all types of pets, and their staff is knowledgeable and friendly. Plus, the pets they have for adoption are absolutely adorable!", "stars": 4, "review_id": 20015}
{"category": "Media & Publishing", "title": "Unhappy and poor service", "review": "I've used this service before and also we are been 5* however this time very frustrating, had order wrongly spelt, I emailed, told them and asked their advice, didn't get response straight away, I had to email again more than 12hrs later, was told told they'd sort it, no apology no nothing, they said I'd get z new in es, I asked to be informed when, no reply, it did turn up in post couple days later, but I'm very unhappy with service and lack of response, I will no try be using again or recommending as in have previously.", "stars": 2, "review_id": 86388}
{"category": "Restaurants & Bars", "title": "I like wagamama", "review": "I like wagamama, good selection and the dishes are delicious. Staff is nice.", "stars": 4, "review_id": 50536}
{"category": "Sports", "title": "Fantastic service", "review": "Very impressed with the service and rebounder. Super fast delivery. Liza was excellent and a credit to the company. How refreshing to find a company that puts its customers first. Would highly recommend.", "stars": 5, "review_id": 11226}
{"category": "Vehicles & Transportation", "title": "Great prices and fast delivery. ", "review": "Great prices and fast delivery even with the cheapest option for postage. Stock is always available when I require it. My go to for my bike parts. ", "stars": 5, "review_id": 79264}
{"category": "Business Services", "title": "Referral Bonus DISAPPEAR!", "review": "I've got referral from my friend to apply BP fuel card with Wilson Daniel in April and my friend told me that we both can get £50 bonus when I first use my fuel card. I confirmed with Wilson and he said the same. I first used my fuel card on 28 April, however, my friend and I still haven't got our bonus. I asked Wilson few times but no response and I also emailed to Right Fuel Card on 29 June but still no response until now.Also, the invoice is difficult to read. I have 2 cars, 1 is Diesel and 1 is Petrol, but the invoice only show the total amount. I would suggest the invoice should provide the breakdown detail. It would be good to show the date, quantity and the amount of each transaction. Therefore, I can easily to check my invoice.**********Thank you for solving it finally and I really appreciate you can provide me the breakdown invoice. I also referred my friend to apply your card, but she didn't get bonus although she asked Daniel and your customer service so long.  Appreciated you can check for my referals as well？ ", "stars": 3, "review_id": 120913}
{"category": "Food, Beverages & Tobacco", "title": "I still haven’t received my case", "review": "I still haven’t received my case. I ordered and paid for it (above the odds in my opinion) on 17/12/22.I haven’t received it as of 10 p.m. on 22/12/22Yodel said it would be delivered within 2-3 working days. Their tracking said it would be delivered yesterday. Now they say tracking is unavailable. In the meantime, I have seen far better deals in local supermarkets. I’m not happy!Update: my case finally arrived intact  on 31st December and compensation has been arranged by Flavourly for the inconvenience. This has allowed me to upgrade to two stars. Yodel have not impressed!", "stars": 2, "review_id": 37434}
{"category": "Sports", "title": "Fast delivery and great shirt!", "review": "Fast delivery and great shirt!My son was very happy with this Christmas present, thanks Mystery Shirt team.", "stars": 5, "review_id": 116392}
{"category": "Home Services", "title": "Great service", "review": "The guys were timely, supportive and did the job they said they would. Thanks Jamie", "stars": 4, "review_id": 43683}
{"category": "Construction & Manufacturing", "title": "Quick delivery and safely wrapped so…", "review": "Quick delivery and safely wrapped so delivered without any hassle. Excellent product easy to assemble and use.", "stars": 5, "review_id": 64141}
{"category": "Travel & Vacation", "title": "Distinct lack of empathy ", "review": "I paid for a membership after buying a small camper,  but due unforeseen circumstances I had to request a cancellation within 13 days of joining. I had used 1 site for 1 night and offered to pay the difference of not being a member and get a refund. The management said no, wouldn’t even discuss it.  That’s fine, I just won’t be using them again when my situation changes. Who wants to pay to support an organisation with no empathy or forward thinking ", "stars": 1, "review_id": 62895}
{"category": "Utilities", "title": "Disgusting Company", "review": "Disgusting Company. Overcharged me with false readings and bills and cut off my water to our horses illegally. Sent in bailiffs to extort fake charges from me, have proved them wrong with an independent report from Affinity Water. Still, no refund, no apology, no redress.", "stars": 1, "review_id": 73549}
{"category": "Food, Beverages & Tobacco", "title": "I paid for next day delivery but waited…", "review": "I paid for next day delivery but waited a few days ordered thur night received on the following Tuesday. Also bottles are coloured glass and have no wrapping around them as in the advertising . and were just delivered in an old cardboard box . These 6 rainbow procecco wine bottlers were for our 8 th wedding anniversary on Sunday my wife was so underwhelmed. Regards mr dadds", "stars": 3, "review_id": 37491}
{"category": "Construction & Manufacturing", "title": "Cheap tickets but not so confident…", "review": "Cheap tickets but not so confident about chances of winning at that price!Not too please when the default tickets per competition was 15 - nearly caught me out when adding to basket!Some good prizes available though - let’s see how I go!!", "stars": 4, "review_id": 64462}
{"category": "Construction & Manufacturing", "title": "Lorry arrived without any prior notice…", "review": "Lorry arrived without any prior notice or phone call on the day.Otherwise OK.", "stars": 2, "review_id": 72742}
{"category": "Construction & Manufacturing", "title": "The quality of tools I have purchased…", "review": "The quality of tools I have purchased are excellent as is the sevice. One quibble I have is the cost of postage on smaller items like replacement carbide tips otherwise I would have given my review 5 stars", "stars": 4, "review_id": 69036}
{"category": "Animals & Pets", "title": "Tried to cancel subscription but no-one…", "review": "Tried to cancel subscription but no-one is listening so at the moment being charged for items that are not required anymore so I  am have to go to the bank to stop this transaction ", "stars": 1, "review_id": 138}
{"category": "Vehicles & Transportation", "title": "I used ATS because of their good…", "review": "I used ATS because of their good reputation. Unfortunately, my local ATS garage was unavailable, so I searched for one close to my address. Crediton ATS, the mechanic who changed my car's oil and filter, left the warning sign on the dashboard. His reason was that I only paid for the oil and filter, which was frustrating. His not very helpful. In my local ATS, after changing the oil, they always remove the warning sign. And the oil stick is very clean, with no signs of dirty oil. After leaving the ATS Crediton, I went to my local ATS and explained the situation, and it was a no-brainer that he helped me. Very disappointed ATS Euromaster at Crediton.", "stars": 2, "review_id": 121920}
{"category": "Animals & Pets", "title": "Terrible service and complete lack of accountability", "review": "This is the second time Feedem have failed to deliver the dog food for my dog. First time they forgot to process/despatch the order and only did something about it when I complained a week later after having absolutely no updates (took the money from my account very promptly though). Second time apparently the courier collected but suddenly got \"inundated\" with parcels and the item was never delivered within the specified timeframe (still not here after 9 days from ordering). When I queried it, Feedem just wrote back to me to say to wait another 4 days and get back in touch if it still does not arrive. Very poor customer service and silly me for trusting them twice!", "stars": 1, "review_id": 49904}
{"category": "Media & Publishing", "title": "3 orders placed, 3 times it went wrong", "review": "Not quite sure where all the good reviews come from, but maybe I was just very unlucky. First order were wedding 'Thank you' cards for one of my clients and there were several cards folded the wrong way so they couldn't use them. As there were enough cards in total I didn't complain as things can go wrong sometimes. Second order was a USB stick, again for a client. Ordered a 16GB but was sent a 8GB. As my couple was waiting for their USB I had to act quickly and order somewhere else with faster delivery times. Simlab told me then again that I would need to pay for the return of the USB myself or I could keep it and they would send a replacement. I agreed to that and cancelled my order with the other lab. 2 or 3 days later the replacement USB from Simlab arrived. This time the correct 16gb stick but it wouldn't work in my Mac, even after I reformatted it. I contacted customer service again and was told that the USB should work and I could return it at my expenses. That's when I decided to give up and write off the money I spent already and pay for a new and working USB from the lab I normally use. All this caused quite a delay in delivering the photos to my clients. Sorry Simlab, but never again.", "stars": 1, "review_id": 86298}
{"category": "Business Services", "title": "SCAM SITE.I ve been using skrill since…", "review": "SCAM SITE.I ve been using skrill since 2022. Everything was fine until my friend send me higher amount of money 3k euro. After  that my account got blocked and waiting to closure. To withdraw my money support asked me of photo of me next to my id, bank statement, and prove of transaction. I provide all of that. Then I got answer, that it was declined and I need to provide different photos and different bank statement. I provide them all of it. And after that, they just simply stop answering me. This whole situation was about 3 months old, cause they were answering extremely slowly and I still don’t have my money back.", "stars": 1, "review_id": 45203}
{"category": "Animals & Pets", "title": "The pet food I purchased is of high…", "review": "The pet food I purchased is of high quality and my pet loves it - I appreciate the convenience of being able to order online and have it delivered to my door.", "stars": 4, "review_id": 49383}
{"category": "Home & Garden", "title": "Shambles", "review": "Shambles Ordered a frame advertised as 24 hour dispatchWeek later, chasedAdvised delay - they would send that dayWeek later, nothing so chasedAdvised did not dispatch, they would send that dayNext day advised frame was actually out of stock, but would send a similar one that dayNext day advised they couldn't send any after all...3 weeks after original orderDo not ignore the bad reviews, this company is a joke", "stars": 1, "review_id": 85509}
{"category": "Food, Beverages & Tobacco", "title": "Easy, efficient service", "review": "The item delivered on time and was packaged well. Good price for the amount provided. No complaints on my purchase of Matcha. ", "stars": 4, "review_id": 36006}
{"category": "Money & Insurance", "title": "The place to be is capital.com ", "review": "I don't have no dislike I am fearly new to the platform, however I enjoy using it. I admit I still don't knw the full potential of capital.com but I am learning everyday..the fact that I deposit and withdraw money makes mi very happy with capital.com.", "stars": 4, "review_id": 58298}
{"category": "Food, Beverages & Tobacco", "title": "I’ve never bought raw sea moss before…", "review": "I’ve never bought raw sea moss before so I don’t have another product to compare it with. However, the gel looks great and really enhances my smoothies. I’m still on the same jar I made up a few days ago and don’t really feel that I can comment on the health benefits of this product yet. Happy to do a follow up review in a month’s time or so. Four stars for timely delivery, good packaging and substantial gel from 70g packs - makes a lot of gel.", "stars": 4, "review_id": 36477}
{"category": "Construction & Manufacturing", "title": "Great products", "review": "I found the ordering site slightly tricky to locate and select my products. However I did and the order arrived promptly and well packaged to avoid damage. The quality of the products is excellent. ", "stars": 5, "review_id": 66692}
{"category": "Home Services", "title": "Fairly unsatisfied.", "review": "Considering my boiler had not been serviced for a few years the engineer was really quick, on previous services things were taken apart and cleaned.", "stars": 4, "review_id": 40133}
{"category": "Construction & Manufacturing", "title": "Really quick delivery at a good price.", "review": "Really quick delivery at a good price.", "stars": 5, "review_id": 71476}
{"category": "Home Services", "title": "Not sure if I’d use them again", "review": "Brilliant engineer who solved the problem for us.   But we were booked for Friday before 6pm, I rang at 5.50pm asking why no one had come and was told that he still had 4 jobs before us!  We were then promised Saturday morning and he arrived Saturday at 5.15pm.  Ok, no big problem, but he then had to charge us extra to what we’d been quoted because it was a weekend!  No issue with the work or the engineer but the booking process and communication seem to need a review.  And I can’t find ‘contact us’ on the website to dispute the extra that we had to pay.  ", "stars": 3, "review_id": 42173}
{"category": "Legal Services & Government", "title": "Thank you very much Ms Eva Daboh from Setfords", "review": "Thank you very much Setfords, especially Ms Eva Daboh who has helped us so far with a process of getting a Shop Lease, a Lease Assignment and purchasing our house. She is also now currently helping my friends with a Lease assignment. She is dedicated, helpful, responsive, kind, honest and especially, she always prioritised my interest and gave me best advices. I will continue recommending Setfords and Ms Eva Daboh for my friends and family. Thank you very much for everything so far Eva 🙏", "stars": 5, "review_id": 100303}
{"category": "Home Services", "title": "I have been a client of Time for You…", "review": "I have been a client of Time for You for several years and have found them most efficient.My cleaner, Emily, is punctual, efficient and a pleasure to have in the house.", "stars": 4, "review_id": 119230}
{"category": "Sports", "title": "Bought two coats both delivered…", "review": "Bought two coats both delivered separately. First one ok second was poor full of marks and stains not convinced that it’s even new. Reported to the company and free postage label sent out. ", "stars": 2, "review_id": 18906}
{"category": "Home Services", "title": "Arrived on time and was very…", "review": "Arrived on time and was very understanding when he saw that I had way more than expected (apparently I have no idea what a cubic yard looks like). He quickly sorted with the company that he could take it all, and they called me right away so that I could pay the extra. He was very quick and they were very helpful in my mistake. Very happy with the service and would definitely use again. Recommend 10/10. Thank you Clearabee!", "stars": 5, "review_id": 88242}
{"category": "Home Services", "title": "Scam Artists", "review": "While this company puts up a professional front they are in fact scam artists who will try milk you for as much money as they can. They will charge money before hand, put 0 effort into finding the problem and say you now need to pay an additional fee and then charge even more for repairs. When you phone then up to discuss it’s always the same guy who doesn’t actually answer your questions and just gives script answers", "stars": 1, "review_id": 43489}
{"category": "Sports", "title": "Massively dissapointed...as a first…", "review": "Massively dissapointed...as a first time buyer, ordered a shirt which was too small..(my fault) after 4 emails to customer support and 2 social media messages,  just asking for basic help with a return  and availability of the same shirt  ,also info on the tracking website as it looks dodgy, and wanted clarity if it was right...not one response...so poor..nothing worse that taking your money with absolutely no customer support...in my case..it's not hard to have a automated repsonse acknowledging your email has been received...", "stars": 3, "review_id": 116988}
{"category": "Money & Insurance", "title": "Samson is fabulous! ", "review": "Samson was so lovely with us and really made us feel like valued customers. In the end we didn’t go with the property he was showing us, but we never felt like we were being pushed into a decision like with other estate agents. Honestly, he was so lovely and made the whole experience so much more comfortable. Thank you so much Samson! Becca and Kate ", "stars": 5, "review_id": 121482}
{"category": "Electronics & Technology", "title": "Rubbish customer service", "review": "Rubbish customer service. What’s the point of buying an extended warranty when a repair can’t even be made in a timely manner. We were left without a washer for 12 days. As a family of five, that is unacceptable. We bought the washer at Curry’s and they were brilliant!  I guess their policy is that repairs must be done within eight days. They emailed back and forth with Hotpoint to get a write off, since the repair was going to take so long. Hotpoint refused the write off. When the washing machine was finally fixed, we were told that holes forming in the drum and pissing water all over the place was a more common malfunction than it should be. ", "stars": 1, "review_id": 31348}
{"category": "Legal Services & Government", "title": "Having to threaten your own solicitor with legal action!", "review": "Please be aware that this outfit is only as good as the consultant solicitor you randomly get given. 1st solicitor was brilliant but they left Setfords during our case and we got given the most incompetent clown imaginable - sending correspondence against our wishes (including spelling mistakes!!), ghosting us for months on end. We've now gone elsewhere but Setfords still haven't returned our holding payment, ignoring requests, sending invoices that have already been settled over a year ago. As everyone is a consultant they have no idea what's going on when the wheels come off....", "stars": 1, "review_id": 100377}
{"category": "Hobbies & Crafts", "title": "A nice sturdy piece of equipment", "review": "A nice sturdy piece of equipment.  Easy to use and has a nice neat finish.  ", "stars": 5, "review_id": 14715}
{"category": "Animals & Pets", "title": "There was very little communication on…", "review": "There was very little communication on the day of the flight. I had no idea my dog got on the flight. I only found out he landed when the agent called me an hour and a half after the flight landed to let me know they hadn't gotten him or heard anything about him yet. I wasn't given a tracking number for his cargo shipment. Overall I wish I had paid a couple hundred pounds more to go with the PetRelocation.com. The price for this service increased by £1000 between when I was quoting and when I was booked. The service they used to transport him from the airport to my residence charged me £65 for 5 miles.  All in all the process was very opaque. I shipped my dog from the US to the UK previously, so luckily I had an idea of what was happening. I can't imagine the anxiety of someone who was doing this foe the first time. ", "stars": 2, "review_id": 29224}
{"category": "Money & Insurance", "title": "It's all in the smile.", "review": "This is the second time I have spoken to Preeya and she is lovely. She listens attentively and makes me feel like my call is important. Most importantly, you always hear her smile, and I leave the conversation thinking that she is driven by customer satisfaction. I really like that. Thank you for being down to earth and approachable.", "stars": 5, "review_id": 55198}
{"category": "Home Services", "title": "Everything was ok..", "review": "Everything was so great , Very professional guys , Fast finished , work well done , only downside is that they set up scaffolding and after finishing work they not took it away... Its bean already neary month and nobody has took them off... Its really bordering me because im not the person who likes complaining or phoning people to do something about it... So we will see how long its will take ", "stars": 3, "review_id": 41772}
{"category": "Business Services", "title": "Excellent service ", "review": "I needed to edit my order but it had already gone to printing. Alex’s customer service was nothing short of excellent; cancelling my order, crediting my account and duplicating my order so i could go straight to my basket, edit and reorder. Amazing service, thank you!", "stars": 5, "review_id": 47676}
{"category": "Media & Publishing", "title": "3 times I have returned a record as…", "review": "3 times I have returned a record as warped and not playing correctly, get one delivered from HMV, this is also warped and not playing correctly; other records are fine, so not stereo. So hard to organise a return or get to speak to someone. ", "stars": 1, "review_id": 81701}
{"category": "Money & Insurance", "title": "i disliked the percentage of the buyers…", "review": "i disliked the percentage of the buyers and the sellers , the buyers are always more than 90% even when prices are falling as if it’s not reflecting the real % ", "stars": 3, "review_id": 58325}
{"category": "Education & Training", "title": "Great experience", "review": "The course are well done, the access is easy, permanent, you can stop and restart whenever you want, and user friendly. Nevertheless, you have to work on your own...Only one thing was missing for me, it is a short and efficient process to make some exercises.", "stars": 4, "review_id": 95886}
{"category": "Vehicles & Transportation", "title": "The parking was excellent- however", "review": "The parking was excellent, however there was a pay as you park option after 3 hours free parking (if you used the supermarket). No area was designated for the parking so I could just turn up and pay. What I am not sure about is whether or not I paid more using just park on this occasion - I suspect I did sadly.", "stars": 3, "review_id": 122401}
{"category": "Events & Entertainment", "title": "Their support is very responsive and…", "review": "Their support is very responsive and helpful.", "stars": 5, "review_id": 109654}
{"category": "Business Services", "title": "42” heavy duty suit/dress carrier", "review": "Purchased 42” heavy duty suit/dress carrier. The product was as described and appears to be good quality (time will tell if otherwise). It was well packaged and basic (free) delivery was quicker than anticipated. Also, reduced price meant it was cheaper than other sites I searched, including Amazon.", "stars": 5, "review_id": 48103}
{"category": "Shopping & Fashion", "title": "Excellent shopping channel and service", "review": "Have been shopping at QVC for many years now after having become house bound due to ill health.  Have gained a great deal of knowledge on various subjects and can say my experience has been excellent.  I have had to return products, speak to customer services - basically have used all their services and can only praise them on a well oiled machine.  ", "stars": 5, "review_id": 22797}
{"category": "Animals & Pets", "title": "AVOID Petmedics (Worsley)", "review": "AVOID Petmedics (Worsley). They're a cold-hearted conveyer-belt money-driven business, totally lacking any genuine care for animals. Our pet dog was happily running around playing with a large twig when it suddenly began choking and fighting for its life. The twig had broken up and part had gone down the back of its throat obstructing it. I desperately tried to remove it by inserting my fingers and in my panicked efforts believed that I may have pushed it or part of it further down its windpipe. We rushed to Petmedics (Worsley) hoping to have its throat examined and requested  sedation and endoscopy to do a deep examination to check if anything was stuck down its windpipe.. This frightening experience - for us and our pet - was shockingly not treated as an 'emergency' and zero 'urgency' was shown. Our dog was placed in a room for three hours without any treatment or examination. After waiting this long we was finally introduced to the vet, who admitted the dog had just then resisted her attempt at examining its throat, to which we reiterated that we wanted it sedated and endoscopy carried out to ensure there wasn't any blockage further down its windpipe. She dismissed it and casually said to take it home and if it started choking again to bring it back. We insisted that she examine its throat by endoscopy, but she replied that if she did, it'd be the following day. Thereby, placing our dog at risk. After a futile plea that fell on deaf ears, we went to reception where we was billed approximately £185 for consultation and treatment. I argued that the vet openly admitted that she had not properly examined or treated our dog and had refused to do any procedures that night, yet, we was billed regardless. I was adamant that I wasn't paying this outrageous amount, just for our dog to wait in a room for three hours. To emphasise, it was the vet who had billed us, not the receptionist. So she was fully aware she was demanding payment for none-existent work. My threat of walking out the door without paying a single penny, persuaded her to accept only the £85 consultation charge. This experience was very disturbing, I can liken it to a baby almost choking to death on an object or swallowing a toy, rushing it to A & E only for the nurses to refuse to examine its throat/air-ways for any obstruction and saying take it home and if it starts choking, to bring it back. Then demanding an extortionate payment for work not done. This company and the particular vet involved has destroyed any faith I had in vets being in the job for animal welfare, clearly some are motivated by career/financial reasons. I actually regret paying the £85 consultation fee, because the vet didn't earn nor deserve it. I am angry and disgusted more than can be imagined at the callous indifference this vets displayed towards our pet dog in a time of 'emergency'.", "stars": 1, "review_id": 114361}
{"category": "Restaurants & Bars", "title": "Food was lovely and staff at Paneer too.…", "review": "Food was lovely and staff at Paneer very helpful, but ordering was exasperating. Payment didn't go through and I had to re-order from memory as I'd gone to Asda by the time I realised. Got there in the end and will use again but pay cash.", "stars": 4, "review_id": 52797}
{"category": "Restaurants & Bars", "title": "Food great", "review": "Food great,  service in general  very good, but one staff staff member a cheeky so and so, we are in all the time with or without vouchers and he pipes up see you next time when you have a voucher, and his attitude stinks.", "stars": 3, "review_id": 110559}
{"category": "Education & Training", "title": "My experience and opinions", "review": "I have to write a review here to let people understand my own experience and opinions. I would hope that through this channel of communication Arden takes onboard these points and makes some attempt to address them for the benefit of future students?.......or maybe an on-line appeasement from their marketing department? Could go either way.  BAD POINTS--------------------------------------------------------- - The \"Cutting edge technology\" as advertised is based on a 90's forum styled platform.- My lessons felt thrown together, work loads for each week unbalanced with so many missing links.- Lessons felt as though they were not directly contributing towards the assessment,  eventually everyone figures this out that they are a waste of time and very little gets submitted on a week by week basis. - Three days to answer an email means that you either push forward with out clarification or you wait for three days.   - Assessments vague, ambiguous and confusing in places, one question came up that was not on any lesson!- Student support not great as they are just part of an IT system. - Admin and financial department must be in chaos as constantly releasing modules late. They would not release my dissertation until I had made a complaint.- Was assigned a supervisor for my dissertation with personal issues.- A complaints procedure that was like shouting in frustration into a dark empty room. I had no confirmation that my complaint was lodged. So I complained about their complaints department, which I received no confirmation also! - Overall, I did not have a positive experience but after a certain threshold I could not walk away.     GOOD POINTS-------------------------------------------------------------It is cheap and you can achieve a certificate.", "stars": 2, "review_id": 92302}
{"category": "Home Services", "title": "Good and bad", "review": "The UK side (dealt with by 1st Move) was very good. As someone who has never shipped cargo before I was given good advice, had the process explained clearly and all questions answered. I was very happy with that part.The NZ end, the shipping agent (Crayford Int Ltd) were absolutely useless. They failed to explain the process, or answer any of my questions. I was very unhappy with them, and hope that 1st move stop using them as they will give them a bad name.", "stars": 3, "review_id": 48055}
{"category": "Travel & Vacation", "title": "WORST MANAGEMENT ", "review": "WE BOOK A HOLYDAY WITH THEM AND ALL GOOD REGARDING THE FLY THEN HOTEL WAS FULL OF BAD BUGS !!, then we report to them and they was hand in hand with the hotel blame each other to not make the refound the worst company if you need to deal with them to take refound !! Avoid for a future ", "stars": 2, "review_id": 62670}
{"category": "Business Services", "title": "RDVault have provided us with excellent…", "review": "RDVault have provided us with excellent service for our R&D returns.  Very good technical challenge in order for us to submit a claim that satisfies HMRCs requirements, but also stepping to help us when we had some admin issues on submission.As well as being technically excellent the team were a pleasure to work with.  Service with a smile!", "stars": 5, "review_id": 47542}
{"category": "Food, Beverages & Tobacco", "title": "Says out of stock but still showing as available", "review": "Placed an order and heard nothing until a week later to say they were out of stock of one particular specialist vodka.  They did not tell me until the day I was expecting delivery.  Even though they are still advertising this item online as being In Stock.  Really messed up my plans as I don't have time now to reorder from anywhere else.", "stars": 2, "review_id": 37507}
{"category": "Hobbies & Crafts", "title": "Support our sisters", "review": "Well you can tell that this is a new business by the items included in both of my 2 different boxes. Some of the items are good but the quality of some of the other items are cheesy and very obviously just stereotypical “witch” items. I’m going to keep my subscription because I think once they have enough money to put together better quality items. This is obviously a new business and I support that. I think there is great potential once it takes off! Blessed be my friends. I support small businesses, family businesses, and I have a feeling from their response that they care about their sisters and put a lot of effort into each one.", "stars": 3, "review_id": 4228}
{"category": "Money & Insurance", "title": "It didn't ask about being taxed…", "review": "It didn't ask about being taxed wrongly. I was receiving letters to \"not known eilidh maccoll\" saying I hadn't filled in a tax return but ive never been self employed. They're now taking money from my benefits", "stars": 3, "review_id": 54884}
{"category": "Electronics & Technology", "title": "Very good overall", "review": "Due to the problems with the post I didn't receive the freepost pack, despite another being sent. I then printed off a label and posted the phone off. Got paid very quickly. The only improvement to make it 5 stars would be if an email was sent to say phone had been received and being tested etc. I only knew that it was ok when the money appeared in my account.", "stars": 4, "review_id": 34138}
{"category": "Beauty & Well-being", "title": "Always good quality products delivered…", "review": "Always good quality products delivered by amazing team. Free items too! Cest bon. Best prices for goods bought", "stars": 4, "review_id": 3472}
{"category": "Vehicles & Transportation", "title": "The only issue I had was it came…", "review": "The only issue I had was it came earlier than expected as I was going to France that weekend I had to rush and change car details on all documents. It also meant I had to buy and get fitted new plates before getting the car ceramiced.", "stars": 4, "review_id": 103356}
{"category": "Restaurants & Bars", "title": "This company do a great range and is …", "review": "This company do a great range and is very affordable wiyth great delivery srevice however there is always room for improvement and they have at times given me the wrong product and although not a problem is annoying", "stars": 4, "review_id": 51460}
{"category": "Sports", "title": "Terrible fabric on the ultimate jumper", "review": "Terrible fabric on the ultimate jumper.  It bobbles really really  badly.  Worn only a few times and now relegated to the ‘scruffy and gardening clothing’.  Very expensive for such dreadful fabric. They are warm though if you can put up with the scruffy bobbling. ", "stars": 1, "review_id": 11936}
{"category": "Home Services", "title": "The installation went well until I…", "review": "Coral Windows tried to get my review removed, but Trust Pilot agreed with my comments that they weren’t defamatory. The installation went well until I noticed that Coral Windows had added the wrong locking mechanism and this was pointed out to the fitter immediately. He informed me that they do this quite a lot  by forgetting to put the correct locking mechanism in. He asked me if I wanted him to inform the company or me? I told him if he could and I would do it from my end too. I telephoned their Sheffield branch and informed them of this and all I was told that this would cost you more money. I said that I had ordered this with their salesman from the beginning as I showed the salesman a photo of the turn key lock on my own front door of what I wanted. This could not have been made clearer. It’s not my fault that their salesman neglected to add it to the order. This door I was/am buying is for my son’s home. When my son came home from work, we both tried the 3 keys out, standing in the cold outside trying one key at an time and only to find out that only one of the keys worked both internally and externally. Sheffield branch have been notified of this and informed me that they are emailing someone in their company to contact me. Guess what??? Still no contact. Not impressed whatsoever. I am withholding payment until these issues are sorted. The longer they take to contact me and to rectify their mistakes, the longer they will get paid. In today’s technology, how on earth do they get a straightforward order wrong. No excuse for no communication to their customer. I have done all the chasing so now it’s down to them to return my calls. Not impressed with the after service. Amazingly, after I had posted this review, I have received several calls to rectify the problems. It’s a shame it takes a review to go live to get the correct response. More powerful than a customer phoning several times highlighting the issues. Also received a voicemail stating that their salesman can’t recall me asking for a thumb turn lock. Can their salesman recall me showing him a photo of the one I have on my door? I can clearly recall this as I didn’t know the correct name of this internal lock, therefore proceeded to show him a photo from my iPhone and he immediately told me the name of it and I said I would like to have the same as what I have on my door for my son’s door. Am I missing something here or could I not have been any clearer? I never once saw the installation man check all 3 keys. He only showed me how to close the door, lift the handle and lock it from the inside. I have suggested that on every door install, they should check that all 3 keys work internally as well as externally. Just read your response and this is slightly wrong - you only contacted me late this afternoon after my review had been posted. No one contacted me until then and I have proof/evidence of this. Please do not bend the truth to make you look good. Be honest.I am having to update my review as I like to be accurate and give actual facts. Coral’s edited response is now showing as the installation was less than a day. It was over a day as the fitter left at 11.07am. Everything is recorded on my son’s CCTV system. I am now being plagued by telephone calls and I have politely asked this to STOP as it only takes 1 telephone call to make the arrangements to rectify the issues. This was done and a day and time agreed. That should have sufficed, but no - I have received quite a few calls and I have had to stop answering my phone. It seems they are only interested in their image and asking me to amend my comments and the 1 star rating. To me, it is evidently clear they only care about themselves on how it will look for them, but not about the customer. I will have to travel a few hundred plus miles there and then a few hundred plus miles back again to get this resolved. Unfortunately, my son can’t be there due to work commitments and as I am buying the door for him, it is down to me to give him a fully functioning door. You wouldn’t buy a car with only 1 working wheel - would you?", "stars": 1, "review_id": 41336}
{"category": "Travel & Vacation", "title": "Avoid. Useless service and significant uplift in prices ", "review": "The first and only time I will use this company - proved to be a nightmare.First of all  I realised after booking I paid close to £300 extra for the flights than if I’d booked with the BA directly.Then they kept sending me inefficient responses to my emails requesting assistance to upgrade. Firstly the wrong IATA number. Then patronising responses that were giving contradictory information between their company and BA. BA also advised me they hadn’t called regarding the booking as they had advised me.Then after checkin I realise the first flight is not the same class as the 2nd flight despite my booking it as one trip - so I had to pay 200cad for the extra case that should have been included on both flights.Just a nightmare long winded frustrating experience overall.The only benefit is paying by PayPal if you want to split the cost over 3 months interest free. But given their uplift cost would be cheaper to pay off interest on a credit card. Will never use them again. Avoid.", "stars": 2, "review_id": 59734}
{"category": "Home Services", "title": "Excellent service again from Finest Van…", "review": "Excellent service from Finest Van again! This is the second time I’ve used this company to move. I’ve also referred them to family and friends who have also been impressed by the service. From the punctual arrival to the efficient yet careful moving and even dissembling and reassembling furniture, everything was great from start to finish.Special thanks again to my movers Nuno and Flavio for their friendly service, professionalism, expediency and attention to detail. I look forward to having them help me again for my next move. ", "stars": 5, "review_id": 40874}
{"category": "Food, Beverages & Tobacco", "title": "Will never use again. Once was enough.", "review": "Order processing was fine, but sat in all day waiting for the delivery as notified from tradewinds. Of course, the notifications from fedex were laughable. But basically said yesterday that they would deliver today between 8am and 11.59 pm. So I rearranged my day but 3.54 pm got a text from fedex (which autocorrects as “defect” which made me laugh) saying that “nah, we’re not going to deliver today” or words to that effect. Having then spoken tradewinds the lady on the phone is adamant that it’s out of their hands, and there was a noticeable shrug of the shoulders. I pointed out that who tradewinds choose to deliver is up to them and if they choose fedex that is on them. My order was with them, not FedEx. So I won’t be using tradewinds again. How hard can it be to arrange delivery? Amazon do it faultlessly every day here, even Royal Mail. But not tradewinds.", "stars": 1, "review_id": 35615}
{"category": "Business Services", "title": "I'm only using the free VAT return…", "review": "I'm only using the free VAT return submission feature at the moment. I've made a couple of successful submissions and one accidentally blank one - for which I had to submit a VAT error correction form and has caused me some pain - hence the 3 stars. I filled in the numbers, the initial submission failed, I resubmitted it and it worked - however it had cleared the form after the first failure!", "stars": 3, "review_id": 45564}
{"category": "Money & Insurance", "title": "Considerate lenders", "review": "Zopa are there to assist those struggling with credit rating by way offering little loans and credit cards which can assist the customer a great deal in building up the rating..Zopa has considered me and their consideration has assisted me to manage my credit build up", "stars": 5, "review_id": 57216}
{"category": "Food, Beverages & Tobacco", "title": "We ordered sweet cones for my daughters…", "review": "We ordered sweet cones for my daughters birthday. They arrived on time and I told Glossop pic n mix that there was younger children there and all the sweets was suitable for the children. They’re just what we was expecting. I can’t fault this company, will definitely be ordering again from them.", "stars": 5, "review_id": 36661}
{"category": "Events & Entertainment", "title": "It was complicated at first had to…", "review": "It was complicated at first had to contact customer service to be helped", "stars": 3, "review_id": 105599}
{"category": "Electronics & Technology", "title": "Horses are faster", "review": "Order was completed and paid on 25th of january. Today is 5th of march. The order is not in my hands yet. It could be delivered from UK to Slovenia with horse faster.BR, Janez", "stars": 2, "review_id": 30331}
{"category": "Home Services", "title": "No one cares about customer service at Coral avoid", "review": "Rang on 14th January regarding a window that we needed to change, the guy who answered said someone would ring back, alas they did not. Rang back 16th January,  woman who answered said someone would ring back, again no-one bothered. What a pathetic and disgraceful way to treat customers, I will never use them again and will tell all my family and friends to avoid at all costs", "stars": 1, "review_id": 41341}
{"category": "Beauty & Well-being", "title": "poor customer service, high price differences", "review": "first of all, prices are much more expensive on amazon than in the fragrance counter online shop - so i would double check where i buy before ordering. second, i have sent a customer inquiry directly after ordering - and never received an answer or confirmation email. so obviously customer service doesn't exist, if there are any questions regarding the products. i think the customer care is very poor.", "stars": 1, "review_id": 5439}
{"category": "Beauty & Well-being", "title": "Great", "review": "Have been using for quite a while now and definitely have noticed a difference so sticking with it.", "stars": 5, "review_id": 4307}
{"category": "Public & Local Services", "title": "Affordable Funerals", "review": "We used the direct cremation service. We were issued with a person to contact and phone number to ring if we had any queries or concerns following the death of my mother in law. We managed to speak and get hold of someone every time and were happy with their response. My only issue was that they were only able to give a date and no time when the cremation was going to take place. In addition, we were never informed that the cremation had actually taken place, and therefore, left wondering if it had? I telephoned the following day to find out. They informed me that they never informed anyone of this and Affordable Funerals had to contact the crematorium to find out. I found this very disappointing in terms of a lack of understanding a families need for this knowledge.", "stars": 4, "review_id": 89182}
{"category": "Travel & Vacation", "title": "All good BUT.....", "review": "All good BUT...... between France and Uk border controls in Calais.'new' cabins have been built for the French BC, but these are not replicated for UK BC. The means 3 queues feed to one queue on LH side. It's stupid, unfair and causes chaos and resentment.  This is so easy to rectify.  The guys in hi viz did nothing to feed cars into correct lanes until after it had gone chaotic.It's been like it years. Just sort out some traffic lanes and stop the chaos.Delays may be a border force issue, but traffic management on your site is your responsibility. Own it and do something about it. The leShuttle employees doing traffic management waited until horns started sounding and people getting out of cars before doing anything. Not a border force issue.", "stars": 2, "review_id": 79829}
{"category": "Public & Local Services", "title": "At Awaaz Manchester", "review": "At Awaaz Manchester, being a small organisation and having lost staff through COVID we simply didn't have the staff time to dedicate for bid writing. NPG were very helpful in securing our first grant in 2024. They supported us in reviewing and improving our application.", "stars": 5, "review_id": 112996}
{"category": "Utilities", "title": "A long time to get a tank", "review": "A long time to get a tank, installation was good and trouble free.", "stars": 3, "review_id": 71165}
{"category": "Beauty & Well-being", "title": "Friendly helpful people to deal with.", "review": "Our first try after being recommended by a friend.\rThey answered our queries promptly and their service was good. \rWe queried the delivery time taken (5Days) and it was not this company but Post Office at fault.", "stars": 4, "review_id": 2916}
{"category": "Health & Medical", "title": "Still waiting for dispatch and/or communication at least.", "review": "I made an order for Mounjaro 2.5mg for the first time 2 days ago. It was confirmed and approved within 10 mins but I am still yet to receive an email regarding my order being dispatched. I have emailed this morning in hopes to get a response on this and am holding out hope, but some of these reviews are making me feel very nervous about it due to the lack of communication received along side the lack of dispensing people’s medication and cancelling orders! ", "stars": 2, "review_id": 13563}
{"category": "Construction & Manufacturing", "title": "Great experience from start to finish", "review": "Great experience from start to finish. Efficient helpful sales staff and products arrived within a few days.The only slight downside was the need to order another individual component to add to my original delivery at a later date which proved to be very expensive due to delivery charges.", "stars": 4, "review_id": 71981}
{"category": "Home & Garden", "title": "Quality", "review": "General service has been good but I am in the process of discussing the long term quality of our leather settes.", "stars": 3, "review_id": 25474}
{"category": "Travel & Vacation", "title": "Only one devise setup allowed on the App", "review": "I could only use the app and pin number on my phone as I purchased the treasure hunt, but needed to have the app and the same trail on another devise as well as mine. Would be really good to be able to have the pin codes for more then one devise. ", "stars": 3, "review_id": 95468}
{"category": "Legal Services & Government", "title": "I got a call out of the blue from a…", "review": "I was concerned about being contacted out of the blue and the lack of email addresses to contact the caller but my review has been answered by CEL personnel addressing most of my concerns and I wish to further contact them to see if they can help me retrieve my money. They seem extremely understanding and their T&C are much more competitive to any other company I have been looking at.", "stars": 3, "review_id": 100461}
{"category": "Events & Entertainment", "title": "trash", "review": "trash with a capital T", "stars": 1, "review_id": 104798}
{"category": "Travel & Vacation", "title": "Christmas and Twixmas in Torquay.", "review": "Back last night from Torbay Hotel,where everything was fantastically planned to perfection, thanks to ALL staff in hotel,who \"worked their socks off\",to keep everyone happy!!!Food was delicious (as normal), lovely warm rooms everywhere,could NOT have asked for more,oh!thank you Father Christmas for my present of a Caledonian mug....much appreciated!. Drivers Dave,and Eric had a hard time with heavy traffic,making it a longer journey than normal,but did a great job...thankyou!!!Finally thanks to all @Caledonian offices all over the country,whom I always love dealing with,Happy new Year.   Xxx   ", "stars": 5, "review_id": 60962}
{"category": "Beauty & Well-being", "title": "Long shipping time ", "review": "I placed my order on Dec 15. It said it ships in 24 h. I got the notification yesterday, 12/23 that the package was dispatched and a tracking number which gives me the message is not in the system. I have no idea when I will get it. Supposed to be a Christmas gift. So ⭐️ ⭐️ for now. ", "stars": 2, "review_id": 9567}
{"category": "Animals & Pets", "title": "Very lovely and friendly staff they saw…", "review": "Very lovely and friendly staff they saw me less then 12 hours of registering my 2 kittens and it wasn't an emergency. great price for flea treatment would recommend to anyone so glad I found this vet.", "stars": 5, "review_id": 114701}
{"category": "Restaurants & Bars", "title": "Discount??", "review": " staying at a premier inn tomorrow and plan on eating at a Bfewers fayre next door,for the past few days I have tried to register on the brewers fayre site,it states a 25 % discount for the first meal when registered...when registering the site states that the request was not successful and try again later..sent 2 e mails regarding this but no reply to date.wonderi g if there really is a 25% discount available,i certai ly can't get it..", "stars": 1, "review_id": 52241}
{"category": "Hobbies & Crafts", "title": "Worst customer service on the net", "review": "Prices are decent and goods arrive on time but condition of goods varies greatly. No padding is used for booster boxes so I've received damaged boxes. Cards labelled as mint often have holo scratches and obvious whitening (not fresh from a pack). Customer service is some of the worst I've experienced to be honest. You'll wait a week for a response, and the response is curt and disinterested. Seems like they'll do anything to avoid accepting returns.", "stars": 2, "review_id": 47891}
{"category": "Food, Beverages & Tobacco", "title": "Sweetzy order", "review": "The order arrived in good time, sweets were very tasty, but we were missing part of our order. I contacted sweetzy straight away and have still yet to receive a reply. I have emailed three times to chase up, and although their website says “we will reply to every email” I am still waiting? Customer service side needs improvement I’m afraid, would’ve appreciated a resolution to our incorrect order.", "stars": 3, "review_id": 38380}
{"category": "Vehicles & Transportation", "title": "Unfair deductions made ", "review": "On reflection the deductions made on the price seem unreasonable. I feel that as a single woman I was taken advantage of in the situation and was bombarded with information and technical terms which made me feel like I couldn’t respond. My main bone of contention is finding out that I was deducted over £400 due to the fact my service due light was on. Now I evidenced a full service history and this light was only to highlight that a service was advised as due. Why does this warrant deduction of £400, when a full service would not cost this amount and again, was only advised. On reflection and had I felt more able to challenge this button could have been turned off. I was also graded a 5 for two areas of damage to my car that I was quoted £1050 for a repair. When I explained this to the person her sugggested that even if I had got it repaired, I would have had similar reductions made to price quoted as on their spreadsheet it’s points for any repair work. I felt overwhelmed and ended up accepting a quote which, when discussed with experts 1hr later seem h reasonable. ", "stars": 2, "review_id": 80039}
{"category": "Business Services", "title": "POOR COSTUMER SUPPORT", "review": "POOR COSTUMER SUPPORTI did not get my refund in my account.more than 4 days of no answer to my emails.every day I email them and they don't even reply.", "stars": 1, "review_id": 46145}
{"category": "Construction & Manufacturing", "title": "All of my order was received but it…", "review": "All of my order was received but it came in 3 different parcels, that would normally be ok but it was over 2 weeks between the first and last parcel.", "stars": 2, "review_id": 64956}
{"category": "Money & Insurance", "title": "Understanding and Polite", "review": "As it was my first time, I was hesitant and apprehensive to find an accountant online. I was looking for someone to refer an accounting firm(I guess there will be others like me). I eventually did select based on an online search and I am glad that I decided to go ahead with DNS.  Sudhanshu was assigned to me and I must say he dealt with all my queries very patiently. I appreciate his efforts and promptness in helping me with my self assessment. Thanks Sonal", "stars": 5, "review_id": 103557}
{"category": "Legal Services & Government", "title": "LPA application.", "review": "Although I haven’t completed the LPA application yet, so far the process has been pretty straightforward. I rang the helpline and they answered my queries.", "stars": 4, "review_id": 99039}
{"category": "Travel & Vacation", "title": "I had a great experience with Travel…", "review": "I had a great experience with Travel house UK. Their customer service is excellent.Francis is an excellent and supportive staff. He provided me a great service and he was very patient with me.Thanks a lot Francis, I extremely appreciate ur help.", "stars": 4, "review_id": 62924}
{"category": "Restaurants & Bars", "title": "Nutriseed Amazing Products", "review": "I have been with Nutriseed for 9 weeks now and have lost 1stone 2 pounds. I find it really easy to fit in to your every day life and don’t feel like I’m on a diet at all. The inches I have lost too make it all worthwhile. I won’t lie the first week was a bit difficult and felt hungry but kept with it and with the help of the Nutriseed Community page I am succeeding with my goals. My favourite blends would be black lemonade, Clarity and courgette soup. Now I don’t even think of my juice days as juice days it is just normal life. Would recommend this to anyone to try and see your results. I have told my friends about it and they are also looking to have a go and try. ", "stars": 5, "review_id": 53873}
{"category": "Education & Training", "title": "Fantastic Workshop!", "review": "My second time at the crypto workshop and it was fantastic! After the first one I started investing quite confidently following the strategies and after the second one so many more questions were answered and I feel I have a better overall understanding. Now feel so much more confident to increase my investments!The team are just amazing with their knowledge, energy and massive patience as well :) ", "stars": 5, "review_id": 96283}
{"category": "Events & Entertainment", "title": "Murder in Margate", "review": "A fun family half term experience! The puzzles were mixed and suited our young teens. We would have liked it to have been a little more spread out but that's only a minor issue. The app worked brilliantly and we had no problems finding our way to the places. I had to contact the company as I lost the email with our play details and they were brilliant and got back to me straight away - top notch customer service! We would definitely recommend!", "stars": 5, "review_id": 108322}
{"category": "Construction & Manufacturing", "title": "The ordering was simple and I was kept…", "review": "The ordering was simple and I was kept in touch throughout the delivery process. However delivery man left it next door despite parking outside our place, two of us being at home .... and the doorbell works. Strange !", "stars": 4, "review_id": 69535}
{"category": "Travel & Vacation", "title": "Good rates flights and promotional flights with payment options that helps you pay in an easy way.. very good online booking and easy booking procedures", "review": "Very trusted airlines agencies that will give you cheap and promotional flights with payment options that helps you pay in an easy way.. very good online booking and easy booking procedures", "stars": 5, "review_id": 59672}
{"category": "Food, Beverages & Tobacco", "title": "I ordered milkis but got a big box of…", "review": "I ordered milkis but got a big box of butterfly florida water???", "stars": 1, "review_id": 35621}
{"category": "Utilities", "title": "United Utilities have put a CCJ in my…", "review": "This Update is a couple of months late.United Utilities finally sorted this out when 1 member of staff took charge. The CCJ was removed all credit agency's were informed and my score returned to what it should have  I was also compensated for the issue and everything has returned to normal. I've changed from 1 star to 3 stars only because this shouldn't have happened and I after all the evidence I provided I clearly should have been listened too.United Utilities have put a CCJ in my name for a property i have never lived at, Furthermore after proving undeniably via photographs of Council tax bills, banking statements, Jury Summons documents and my UU account for another property i own (to which they have changed my DOB and spelling of name) That i never lived there they passed this debt onto a debt collection company. They claim to have received my details from a third party (This third party was the council that own the property) The same council that my Council tax bill is from! They give you 1 email address and never respond, they don't call you back and you have to chase them. This is the most unprofessional and corrupt business i have ever come across.", "stars": 3, "review_id": 75732}
{"category": "Legal Services & Government", "title": "very unhelpful", "review": "very unhelpful, would never use them again", "stars": 1, "review_id": 99414}
{"category": "Construction & Manufacturing", "title": "Installation of gas central heating", "review": "Arton plumbing and heating were recommended to me by a friend who had used them previously. They were prompt and clear in all dealings with them. They were polite and tidy and completed the work in a timely way. I have no hesitation in recommending them.", "stars": 4, "review_id": 71672}
{"category": "Education & Training", "title": "No the best", "review": "We have been experiencing issues with Harriet Ellis for over a year now. The students have been constantly getting sent mixed messages and both of my girls are now on their 4th or 5th Dental Educalionst. The course structure is not relevant to the exam the questions. I think this really needs looking into.Jennifer is one of the latest Dental Educalionsts and since she took over she has been extremely helpful. I hope things go forward from now.", "stars": 2, "review_id": 93826}
{"category": "Travel & Vacation", "title": "Responsive staff", "review": "You have to fill in a form and response was fairly fast to request any missing info. We had some difficulties obtaining evidence to meet terms and conditions but I was able to discuss this over email and refund was approved.", "stars": 5, "review_id": 59267}
{"category": "Shopping & Fashion", "title": "Still waiting......", "review": "I haven't received the item I ordered on Sunday. It's now Friday and I had an email last night to say that it had been dispatched but Royal Mail, the carriers, have no trace of it on their tracking service. I am unable to register with the Shop App - tried that yesterday - so I have no idea what's happening.", "stars": 1, "review_id": 7400}
{"category": "Beauty & Well-being", "title": "Absolute shocker", "review": "Absolute shocker, evri delivered to a random house in the street at 10.20pm....., nowhere near my address, person who received it has dementia and it's now lost.  Evri say nothing to do with them, cosmetify say the same thing so now I have no delivery, no way or resolving, and yet no one has done anything wrong ", "stars": 1, "review_id": 5265}
{"category": "Business Services", "title": "2000£ Credit limit", "review": "My account is 3 years old, I have a credit limit of £2000, i always spent responsibly i never occurred any late fees, never had any dispute, recently  i had anOrder that was lost due to the courier mistake. 1- the courier admitted in writing and advised to seek further option from the seller, 2-the seller offered a refund in writing, however they have not proceed with it. I have reported this to ClearPay thinking they ill take care of it and to my surprise they have closed  the dispute TWICE   in less 72 working hours, in The Favour-of the merchant saying they have complied with their merchant terms and conditions and no Refund is due?? now checking the term and condition they referring to it says the following: CLEAR PAY AND MERCHANT TERMS AND CONDITION ——2.2. Obligations in respect of Clearpay Purchases—(b) Subject to clauses 2.2(c) and 2.2(d) of the General Terms, where your Customer makes an online Clearpay Purchase, you are responsible for ensuring that all Goods are Delivered to the Customer promptly.(f)You are responsible for your supply of Goods to your Customers and ensuring that appropriate insurance policies are in place for your Delivery or supply of the Goods to your Customers.———-Payment, returns and refunds by Customers—-(d)If you agree with your Customer that you will provide them with a Discount, or agree to Refund anypart of the Sale Price for any reason, in respect of any Goods:if we have made a payment to you in respect of those Goods, you will be liable to us for the amount of that Discount or Refund on the applicable Payment Date and we may recover those sums in accordance with clause 3.1(d) of the General Terms;(iii) Clearpay will: (A) cancel any future payments due by the Customer to Clearpay in relation to the Goods purchased from you; and/or (B) refund to the Customer any amounts paid by the Customer to Clearpay in relation to the Goods purchased from you,Despite the above CLEAR-PAY enforce their terms and condition on the customer ONLY even if the merchant at fault, so technically when you placing an order through CLEAR-PAY you doing so at your own risk,  Unlike through any UK Bank,  Klarna or Paypal. If i provided my proof to any of the above institutions a refund will be recovered 100%, but With ClearPay NOThey simply support the merchant always at any cost, they do not comply with their own terms and condition and their famous sentence is “Clearpay is not responsible for lost orders” however they do not mention to you that according to their terms and condition published online this specific rule applies both sides not just the customer! Im seeking a Mastercard chargeback through my bank once Final response provided ", "stars": 1, "review_id": 46540}
{"category": "Sports", "title": "Surfdome were fine but the delivery…", "review": "Surfdome were fine but the delivery took 17 days from order date and appeared to have involved going to Belgium before returning to the UK.", "stars": 3, "review_id": 23057}
{"category": "Shopping & Fashion", "title": "Worst experience ever", "review": "Worst experience ever. I otdered a product and got completely a different product delivered.I have been trying to return the product since 3 days and there is no update from your end.I will be not shopping anything from this site going forward.", "stars": 1, "review_id": 7785}
{"category": "Sports", "title": "No items not refund", "review": "Ordered items before Christmas, dpd spent a week saying we weren’t in and couldn’t deliver before parcels got returned to surfdome. Spoke with dpd and the guy on the phone said it was indefensible as the driver had lied about trying to deliver. Where as this isn’t surf domes fault during this time I tried several time to call them and waited on hold until I ran out of time, I still haven’t received a refund for my items", "stars": 1, "review_id": 23101}
{"category": "Events & Entertainment", "title": "Woosung Brooklyn, NY ", "review": "I loved the show (Woosung). Exceeded expectations. Ticketing was easy. The staff and security were organized, helpful and kind. It was a little hot inside during the show, so I would dress appropriately, street parking, where you could find it.", "stars": 4, "review_id": 108096}
{"category": "Shopping & Fashion", "title": "Not so good", "review": "Not as helpful as I expected", "stars": 3, "review_id": 99500}
{"category": "Education & Training", "title": "Really great courses. Good support", "review": "Really great courses, very informative. Can reach a member of the team quickly by their Facebook messenger and you get very prompt replies with great support. Nothing is ever too much hassle for them, I thoroughly enjoyed all the courses I have done (manicure, acrylic, gel) and have passed all of them :)", "stars": 4, "review_id": 97062}
{"category": "Education & Training", "title": "Great people", "review": "Excellent tutor and admin team - responsive, polite and demonstrably hardworking. Nicky is knowledgeable and keen to build a strong understanding of the content with her students. Wish study material had more questions to practice with.", "stars": 4, "review_id": 94561}
{"category": "Animals & Pets", "title": "My experience related to this practice was a nightmare.", "review": "My experience related to this practice has been a true nightmare. With the exclutsion of the Senior Vet Julie Roberts who admitted Falkon, my Persian cat, at the hospital on the 21 of May 2022. The cat was hospitalised 2 nights and 3 days. A Biopsy of the lump of his neck was performed on the right han side of the neck while the infection developed in 2 abscess bursts on the left-hand side only two weeks after he was discharged. The infection lasted 3 months and was eventually resolved in August 2022 with an appropriate antibiotic treatment given by another practice. Don't trust the administration, and the quality of the service  as the people working there have to respond to a greedy administration.", "stars": 1, "review_id": 114486}
{"category": "Sports", "title": "Repetitive", "review": "Starting off, I have purchased 5 Mystery boxes from MysteryFootball. When i received my first shirt it was a genuinely nice shirt and I was happy with my purchase. So I started my subscription.For the last 3 Months I have received a Portuguese Top every month feeling a bit repetitive. I complained to them about the repetition however they were happy for me to cancel.The Customer Service from these guys aren’t the greatest you would think they would love a bit of retention. Oh well i’ve cancelled and will be seeking another shirt company. Sort out your retention guys.", "stars": 2, "review_id": 116459}
{"category": "Education & Training", "title": "Completely disaster", "review": "Completely disaster! At the end of my course Avado requested from all of us to resubmit first 3 units which was done more than 6 months ago as the criteria did not match with the CIPD expectations. Many of the questions has been removed which is a completely waste of my time and on top of that the rest of the questions has been slightly changed so needed corrections. Clearly lack of organisations and communications between Avado and CIPD. So much stress after a long year of intense studying!!! So unprofessional! Completely disaster!", "stars": 1, "review_id": 97490}
{"category": "Business Services", "title": "Hello", "review": "Hello, your colleague Charita was very eager to help. During a time when I was worried about my information, she provided me with a lot of supportThe only issue I had was that I just changed the address and email information, but the device data did not return, and I have to recover it again.", "stars": 4, "review_id": 45288}
{"category": "Legal Services & Government", "title": "Conveyancing work was handled very professionally but ! ", "review": "We have no complaints at all about Natalie who acted on our behalf but our issues lie with the accounts department who for some reason have still not paid our monies 3 days after completion. Luckily we are currently renting not waiting to move into a new property ", "stars": 3, "review_id": 102690}
{"category": "Food, Beverages & Tobacco", "title": "Great freshly roasted coffee at great…", "review": "Great freshly roasted coffee at great prices. Love the fact they do 500g bags. ", "stars": 5, "review_id": 111456}
{"category": "Public & Local Services", "title": "Efficient and helpful", "review": "We were dealt with quickly and efficiently.  Given information on different saving accounts.  Very happy with the service.", "stars": 5, "review_id": 89763}
{"category": "Travel & Vacation", "title": "Very disappointed in the attitude of…", "review": "Very disappointed in the attitude of the staff . Telling me that some accommodation would be out of my price range ! Payment links didn’t work, wrong telephone numbers for contact, switchboard shut when website said it should be open. Other ways to book the holiday .", "stars": 2, "review_id": 62095}
{"category": "Food, Beverages & Tobacco", "title": "Botched Order ", "review": "I am so disappointed with my first ever order. First: I ordered and paid and, that went swimmingly. Second: I thought the order was taking a long time so, i looked on my email & i was correct it wasn't only late it was missing? I wasn't aware nor told by the company.Third: I called the helpline explained then i find only half of my order is available!! So yeah. Disappointed ", "stars": 2, "review_id": 110865}
{"category": "Sports", "title": "Long returns process", "review": "I had no issues with buying, shipping, or arrival times. However, Unisport have taken 2 weeks to process a return after receipt of the item and I am still waiting for the money to be returned to my account.Customer services mostly send generic responses to emails.I won’t shop with unisport again.", "stars": 2, "review_id": 117612}
{"category": "Animals & Pets", "title": "Evri let Petsathome down again", "review": "As with other customers my problem is with Evri - they keep failing to deliver my orders. The online support from Petsathome is excellent but sadly the staff are left apologising for a delivery service they can do little to change! Again the Petsathome staff are great.", "stars": 3, "review_id": 19512}
{"category": "Education & Training", "title": "It was okay", "review": "It was okay, it was informative. It wasnt really tailored to the individual learners and felt a bit monotone and flat. ", "stars": 3, "review_id": 97272}
{"category": "Shopping & Fashion", "title": "The placing and management of adverts…", "review": "The placing and management of adverts is not so straightforward as it used to be but does create succesfull sales. However, the website doesn't always respond to key input and also generates unexpected messages such as 'renewed your advert' when I have just created a brand new advert. Also, I used to be able to advise (via the dashboard) that an item has been sold but that facility no longer seems to exist, why ?", "stars": 4, "review_id": 81842}
{"category": "Travel & Vacation", "title": "You have a walk with a difference…", "review": "You have a walk with a difference learning information about places very enjoyable few hours we really enjoy the trails.", "stars": 5, "review_id": 95420}
{"category": "Animals & Pets", "title": "Above and Beyond Exceptional 🤩", "review": "My little Cat Daisy is currently healing from a spinal injury. Everyone at Apex vets are being so professional and supportive. Going above and beyond in her ongoing needs and care. I’ve never had a vets that’s so caring. Can’t thank you all enough 🥰", "stars": 5, "review_id": 1720}
{"category": "Utilities", "title": "Rubbish communication", "review": "Rubbish communication. 4th year of waiting for ground works to be actioned to ensure we are receiving correct bills. No meter readings for 4 years due to being unable to read meter. Neighbours same.  Calor useless 😒 ", "stars": 1, "review_id": 73852}
{"category": "Utilities", "title": "Still waiting for smart meter to be…", "review": "Still waiting for smart meter to be connected. Told no access was required which was not true. Work carried out was satisfactory. ", "stars": 3, "review_id": 75293}
{"category": "Restaurants & Bars", "title": "I honestly didn't think I would enjoy…", "review": "I honestly didn't think I would enjoy my meals. It is the first time in years that I have tasted to my taste buds delight authentic Jamaican cuisine without my mother's cooking it.  I'm definitely placing my next order within the next week! Thank Pat for your passion for creating authentic Jamaican cuisine. I salute you!    ", "stars": 5, "review_id": 53350}
{"category": "Construction & Manufacturing", "title": "I have only given you 3 stars because…", "review": "I have only given you 3 stars because you didn't turn up for the appointment. I understand that this was a computer glitch not putting appointments in the diary. I also had to chase up the following day's appointment because I was given \"late morning, lunch ish sort of time\" and I think you arrived about 2 ish.Your engineer seemed to do a thorough job and was tidy.", "stars": 3, "review_id": 71109}
{"category": "Food, Beverages & Tobacco", "title": "Very pleased with 1st order received…", "review": "Very pleased with 1st order received 2nd order all was lovely but  the strawberry bars had pieces of plastic in them. Obviously this has put me off ordering again. ", "stars": 2, "review_id": 38779}
{"category": "Business Services", "title": "Brilliant ", "review": "The app is fantastic, great for checking where you are when out and about and it's easy to find routes (including mountain bike), bookmark them and plot your own. Simple to download areas for offline use. It's also great to have all the detailed OS mapping in your pocket just to see interesting features even when not walking or biking. ", "stars": 5, "review_id": 98734}
{"category": "Utilities", "title": "We have used Tate Oils for a good few…", "review": "We have used Tate Oils for a good few years now and have never gone anywhere else. The service is second to none and our account manager Carl Timmins goes above and beyond to make sure our requirements are met. Its very important to have a good relationship with your suppliers and customers and Carl does exactly that. If my account manager is away then then who ever answers the phone is also just as professional and friendly which makes a buyers life so much easier!", "stars": 5, "review_id": 120749}
{"category": "Construction & Manufacturing", "title": "Will order again", "review": "The representative came on time and was knowledgeable and polite.. We are very pleased with the window pane. The price was very competitive.", "stars": 5, "review_id": 65614}
{"category": "Health & Medical", "title": "Highly recommended.", "review": "After needing to be seen at short notice,I was attended to with professionalism, friendliness and a faultless service from Dentist Ali and his dental nurse.Having been a patient for quite sometime I can highly recommend Gentle Dental to anyone looking for a first class dental practice. Thanks once again,Cliff Webb.", "stars": 5, "review_id": 12130}
{"category": "Electronics & Technology", "title": "I ordered for a complete set of Russell…", "review": "I ordered for a complete set of Russell Hobbs blender top 1.6 litres . The wrong set was sent to me instead of the item with Model Number: 25192 that I needed. Please advise me as to how to return the wrong item and when you will send a replacement including any adjustment in price if necessary. ", "stars": 1, "review_id": 30144}
{"category": "Vehicles & Transportation", "title": "Friendly staff but dirty standards.", "review": "Booked into have break pads changed. Staff friendly enough, service was good but noticed my car seats, handles and centre console were covered in dirt afterwards. Quite disappointing that seat and floor mat covers are not used as standard to protect customer interiors.", "stars": 2, "review_id": 80891}
{"category": "Education & Training", "title": "Not entirely great", "review": "Not entirely great. The salesman promises alot that wasn't delivered, I had to make complaints just get what was promised to me as part of the sales process. The e-learning was often incorrect (example: \"your answer is correct\" even though the 'correct' answer that it showed exactly matched my answer). The study books had spelling and mathematical errors in them, confirmed when I queried with my tutor. If you're looking for an unsupported, overpriced and pretty lack luster study provider, choose Avado!", "stars": 2, "review_id": 97469}
{"category": "Education & Training", "title": "My experience was very bad", "review": "My experience was very badInstructor was very rude to everyone.....his name is TygathI passed and they got my name wrongly on the certificate and it affected the urgent processing with SIAThanks ", "stars": 1, "review_id": 92675}
{"category": "Home Services", "title": "Knotweed in Southampton.", "review": "Japanese Knotweed Ltd are a very professional and efficient locally based Company, which has helped allay the fears of this intrusive plant and give the customer confidence that their treatment, which already is proving effective, will be successfully completed by the end of their contract.", "stars": 4, "review_id": 40196}
{"category": "Animals & Pets", "title": "Not made for tough chewers", "review": "Sadly, our medium labradoodle ate a big chunk off the hammer within 45 seconds. We thought these would be great for chewers. We did receive a full refund and customer service was great.", "stars": 1, "review_id": 28996}
{"category": "Money & Insurance", "title": "Honestly just building the fist…", "review": "Honestly just building the first template I already know this worth more than any other course I bought before. Any retail trader who’s struggling this is definitely for you! Thank you mentor🙏🏾", "stars": 5, "review_id": 113815}
{"category": "Health & Medical", "title": "Waiting for the results ", "review": "I am waiting my result for 3 weeks, I chat with Jordan, Jordan  explained that the samples has been sent to UK, thats way it takes longer then expected. Thanks for explaining. ", "stars": 5, "review_id": 12836}
{"category": "Home & Garden", "title": "Still waiting for refund for goods they advertised and didn’t have in stock - informed on phone would do an immediate refund", "review": "See previous review. Payment made 3 August.Items not in stock although advertised on website.Told would be given immediate refund.Now 22 August - still waiting for refund.Again clearly shows type of business I am dealing with !", "stars": 1, "review_id": 107496}
{"category": "Beauty & Well-being", "title": "Wish I would have checked their…", "review": "Wish I would have checked their feedback as they have now stolen my money.", "stars": 1, "review_id": 119682}
{"category": "Travel & Vacation", "title": "Clerkess was a classic non listener", "review": "Clerkess was a classic non listener. Considered herself far more important than the customer. The customer whose business pays her salary. Shocking experience", "stars": 1, "review_id": 63086}
{"category": "Health & Medical", "title": "Simple and easy to use service", "review": "Simple and easy to use service. Really pleased, thank you.Post was a bit of a frustration, think that was a RM issue rather than TFC however no way to contact them over the weekend so the refrigerated package wasn’t cold on arrival.", "stars": 4, "review_id": 4738}
{"category": "Utilities", "title": "Having made contact with this company…", "review": "Having made contact with this company back in October, I did receive 2 calls and an email. Then nothing. I completed the online form again and then received a call back over several days. Didn’t answer, as not in my contacts. No voice message left. Rang back and since everything seems on track. Only hope I need to contact that the number given works.", "stars": 4, "review_id": 75569}
{"category": "Public & Local Services", "title": "I was completely overwhelmed trying to…", "review": "I was completely overwhelmed trying to find the right senior living solution for my elderly parents until I found Modern60. Their caring team guided me through every step, from detailed community tours to side-by-side comparisons. The personalized recommendations they provided eased the stress of a daunting task, and their compassionate staff answered all my questions along the way. I’m incredibly grateful for Modern60’s guidance and support as a caregiver.", "stars": 5, "review_id": 90060}
{"category": "Legal Services & Government", "title": "First time buyer last time user ", "review": "Quite frankly- this was the first time I have ever needed a conveyancing solicitor, as it was my first ever purchase. The person I was assigned was unhelpful bordering on rude. Slow and offered no insights, sometimes sent emails containing paperwork with no explanation of what it was or why I needed it. As a first time buyer I would've liked some guidance through the procedure, none was offered, nor any updates until the vendor chased for a completion date. Documents were said to have been posted by next day delivery, and arrived days later. Please avoid them, especially if this is your first time buying. It has not been a pleasant experience and I will not use them again, I will also recommend to anyone I speak with in my town to find a different firm. I can't speak for the company as a whole, but in my local area, the solicitor I was assigned was not good. ", "stars": 1, "review_id": 100378}
{"category": "Vehicles & Transportation", "title": "Wrong Window", "review": "I arrived at the place in Roche and they had sent the wrong window. A temporary fix was put into place, but then had to wait for a home visit the following day", "stars": 3, "review_id": 76058}
{"category": "Hobbies & Crafts", "title": "Ordered and paid for item two weeks …", "review": "Ordered and paid for item two weeks ago, was told item not in stock and would be sent out Thursday this week instead. Item not received, no reply to my emails requesting an update on order. Very very poor service no idea how I am supposed to get my money back now they do not respond to emails.  Do not give this company your custom!", "stars": 1, "review_id": 28327}
{"category": "Beauty & Well-being", "title": "Very fun product!", "review": "I love the colors that are available.  I wish that there were more instructions given about how to get the formula right.  It seems very self-explanatory, but I find myself struggling to get the right consistency and sometimes it's too watery, so I add more product, which ends up making it crack and flake.  I think it's okay that a product takes some time to get a hang of, but it would be helpful if they sent a card with some 'troubleshooting' tips.", "stars": 4, "review_id": 6711}
{"category": "Travel & Vacation", "title": "Comprehensive information on most…", "review": "Comprehensive information on most properties available. Reviews well worth reading. Web sites very good with mainly enough relevant information.Once your decision has been made then easy to book online with payment schedule quite clear and then an immediate confirmation of your initial payment and booking from Sykes.Sykes Cottages are totally reliable as long as you have a good idea of the type of property where you would wish to stay. ", "stars": 5, "review_id": 59174}
{"category": "Business Services", "title": "Nightmare to find the the Vat page to…", "review": "Nightmare to find the the Vat page to file. Pressing home kept going back to 123 sheets home page. Then after hours of messing it went to my Vat account. Should rename button VAT not Home", "stars": 2, "review_id": 47832}
{"category": "Legal Services & Government", "title": "Helpful employees ", "review": "Very helpful employees at winn assist. Spoke to Emma Mason today who helped sort out some final details to my claim. Took alot of the stress from dealing with the incident away. ", "stars": 4, "review_id": 100917}
{"category": "Vehicles & Transportation", "title": "Read all the small print! ", "review": "Booked a room at Premier Inn Sunbury for a night and got told to use the adjacent carpark which is managed by yourparkimgspace. Once I parked I read the signs and downloaded their app. When I checked in at the hotel the receptionist told me I could come and go from the carpark and would only be charged the once and gave me a discount code to use. I left the carpark and on my return I found a pay machine which I used and paid my £7. The next day I was charged another £9, I spoke to customer service and this got refunded, five days later I got charged an extra £45, again I contacted customer services, they informed me that their cameras didn't pick me up leaving their carpark. I was informed them a few times the time I left. They agreed to give me a refund. Today I had confirmation that my refund was being processed but for the pleasure of their camera not detecting me leaving and the stress this has caused I've been charged £3! Be careful using one of their carparks. ", "stars": 3, "review_id": 89498}
{"category": "Electronics & Technology", "title": "Got what I ordered in good time", "review": "I couldn't say customer service was great like some of the reviews say. As my purchase, dispatch and delivery process seemed automated. I did wonder for a short time if my speakers (Kilpsch RP-8000F ii's) would be dispatched in time but they were and I received them a day later.I got what I ordered, in good time, at the going rate without any hick ups. No complaints with that.", "stars": 4, "review_id": 33642}
{"category": "Travel & Vacation", "title": "Helen and Richard’s hospitality was…", "review": "Helen and Richard’s hospitality was warm and welcoming and Helen was brilliant at guiding us in on a foggy dark evening and welcomed us with Christmas tree lights and a warm cosy hut. The hut itself is a jem, cosy and inviting with all you could need for a seriously relaxing get away. The views are incredible, the sheep across the fence gorgeous and curious and the hot tub was bliss! We cannot wait to book again. Thank you both! ", "stars": 5, "review_id": 59478}
{"category": "Education & Training", "title": "The course content of the IASSC Lean…", "review": "The course content of the IASSC Lean Six Sigma Green Belt doesn’t cover well what you need to know for the certification exam. When sitting for the exam I saw too many concepts that were not part of the training module. Practice tests are very basic without explaining the answers. The Udemy course for 16Eur was much higher quality.", "stars": 1, "review_id": 96054}
{"category": "Education & Training", "title": "A complete disappointment", "review": "I booked this as a treat for my son before his GCSE exams that are due to start this week. I thought it would help alleviate stress by taking his mind off it. He was incredibly excited until the morning of his driving lesson we received a text message to say it had been cancelled. My son was really upset", "stars": 1, "review_id": 96912}
{"category": "Home & Garden", "title": "Great customer service!", "review": "Having some issues with my boiler just before NYE - absolute nightmare! While it wasn't ideal to hear PlusHeat is undergoing technical issues, Zoey has stayed on my breakdown case throughout the whole day to ensure I get an engineer as soon as possible. Good job Zoey!", "stars": 5, "review_id": 64556}
{"category": "Events & Entertainment", "title": "Received an email that the performance…", "review": "Received an email that the performance booked months in advance has been cancelled and was issued a gift voucher rather than a full refund, being told to contact to ask for a refund (with a notice that they are receiving large volumes of contact and will take a while to reply). No apology in the email. I understand things happen but customer service seems poor and have now got a non refundable hotel as a result. ", "stars": 1, "review_id": 107703}
{"category": "Home Services", "title": "My flooring arrived with significant …", "review": "My flooring arrived with significant  damaged wet,and muddy.This is down to the currier service,it was not very well packaged product hanging over the edge of the pallet leaving it vunrable to damage.I did.get a full refund from my order but it was quite stressful. They must sell lots of products and things go very well it was unfortunate that I experienced issues, sh....t happens. ", "stars": 3, "review_id": 43001}
{"category": "Shopping & Fashion", "title": "Am I ever going to receive my order?", "review": "Placed order for a travel bag at a competitive price on 29th November and paid £5.99 for tracked delivery, which was due to be between 3rd-5th Dec. On 3rd Dec I received a tracking number and a message saying that the item had been despatched to Royal Mail for their 24 hour delivery service. Since then the tracking has not updated and item has not been received, so I am now dubious as to whether it is actually in stock and will ever be sent?? I have tried phoning customer services but (as other reviews have said) you just get a recorded message telling you to email them then the line goes dead! I just want to know if/when I will get my bag which is urgently required or whether to try and cancel order and start again with another supplier. I will not use this company again. ", "stars": 2, "review_id": 18285}
{"category": "Electronics & Technology", "title": "DJI Mini 4 Pro", "review": "Having phoned the previous afternoon, I was able to go to the store and pick up my Mini 4 Pro. Because the cellophane around the box was slightly torn, I got a good discount, and was given a couple of extras as well.I've finally managed to get some good weather to fly the drone, and it is fantastic. Definitely a step up from the Mini 2!Thanks for the coffee too.", "stars": 5, "review_id": 32717}
{"category": "Health & Medical", "title": "I would like to share my experience…", "review": "I would like to share my experience with DC Antalya. I got my teeth done 2 months ago here I had composite bonding done 6 upper 6 lower. My experience didn’t go as smoothly as I wanted it to. My stay got extended longer than I wanted it to as they had to fix my teeth as it didn’t look good. I experienced a lot of faf after being 80% happy leaving I’m now experiencing more problems with my composite bonding. Iv already had two teeth that have chipped making my smile look ugly to the point I don’t even want to go out, after explaining the problem to them they think I can just jump on the next flight and come ? Iv had enough of the back and forth I wouldn’t recommend this dentist and I won’t be coming back ever again.Melda Guclu.  ", "stars": 1, "review_id": 13644}
{"category": "Utilities", "title": "Old meter experience Over the last three months I have had…", "review": "Over the last three months I have had really problems with my electric meter and my account finally I have made some progress with the care team at Pozitive and hopefully it will be totally resolved within the next four weeks.", "stars": 3, "review_id": 70841}
{"category": "Sports", "title": "OK but not as good as Musto", "review": "OK, but nowhere near as warm as the thinner/lighter Thermal base layers from Musto.", "stars": 2, "review_id": 11923}
{"category": "Education & Training", "title": "I surprised myself!", "review": "I’ve not studied like this since leaving college & I can honestly say I’m so proud of myself! Karen Marsh was a brilliant tutor who supported me when I found it getting tough and juggling some challenges in my personal life. I would definitely recommend this course…. I’ve learnt so much and with the internet, research is so easy! It took me much less time than two years to complete, even with a full time job and having kids….  Just set aside a few hours a week.", "stars": 5, "review_id": 91670}
{"category": "Food, Beverages & Tobacco", "title": "Answer to all gut issues!", "review": "I have suffered from gut issues for as long as I can remember. Laxative abuse, bloating, gastritis … Biomel has helped restore my gut, it’s taken time for my gut to heal but Biomel has been my gut-saviour, quite literally!! I cannot recommend it enough! I have 4 servings a day to get the full benefits of chicory root and it’s my miracle! Biomel for life! 💯!!", "stars": 5, "review_id": 115718}
{"category": "Legal Services & Government", "title": "Helpful and understanding", "review": "Keely was understanding of the accident, empathetic and efficient. She explained everything really well and clarified points very well when needed.  ", "stars": 5, "review_id": 102072}
{"category": "Sports", "title": "5* service throughout", "review": "Amazing service from Amanda & Peter throughout. It is always difficult to order a bat online but they made it seamless and took time to get the specific weight and balance I required to offer a really personalised service. Really like to support independent stores and the IXU range is brilliant! Couldn’t recommend  highly enough, I will be back.", "stars": 5, "review_id": 10092}
{"category": "Vehicles & Transportation", "title": "Excellent & Honest Euro Car Parts", "review": "Parts delivered on time as promised, very good customer care, even refunded extra that fitter  charged above quote. All round excellent service. Thanks ", "stars": 5, "review_id": 80627}
{"category": "Education & Training", "title": "Great Tutor (Martin) my only concern…", "review": "Great Tutor (Martin) my only concern was the course content, which isn't goldcross fault I did my SSSTS at Dartford and like any course I was nervous to start, but with Martin's help we got through it and made the class enjoyable ", "stars": 4, "review_id": 113743}
{"category": "Money & Insurance", "title": "Good service for CIC accounts", "review": "The CIC accounts and report were fairly simple to process and submit to Companies House. Having said that, Debitam provided a friendly and efficient service. Recommended.", "stars": 3, "review_id": 55513}
{"category": "Animals & Pets", "title": "Prebiotic and probiotic supplement for dog", "review": "Started my dog on this as he has been very subdued and quiet and sleeping a lot. After 6 days have noticed a difference. He is more alert and himself. Barking at everything and sleeping less. Nice to have my dog back.", "stars": 4, "review_id": 49388}
{"category": "Food, Beverages & Tobacco", "title": "SCAM ALERT! AVOID!", "review": "I ordered a cake by phone from this company on 21st December 2024 and was assured that, my cake would arrive between 6pm and 10pm on the same day. I then cancelled pre-arrangements to ensure I was at home when the delivery arrived, however, the delivery never arrived nor did they have the decency to call me. I've called their advertised numbers: 07915-759909 and 0203-4759909 several times today (22nd December 2024) to no avail. I have now left a voicemail message on their mobile contact number (the landline number voicemail is apparently full!) advising them that, I WILL BE REPORTING THEM AS A SCAM TO MY CREDIT CARD COMPANY AND I WILL HAVE MY MONEY REFUNDED! I ALSO INTEND TO REPORT THEM TO OTHER APPROPRIATE AGENCIES FOR FRAUD! ", "stars": 1, "review_id": 35075}
{"category": "Health & Medical", "title": "Long time patient…", "review": "I have been with this practice for much of my adult life (the dental practice I was with from a child was taken over by them). I have always found all the staff, receptionists; hygienists; dental nurses & dentists to be friendly, yet professional and the actual surgery I now attend is modern bright & always looks exceptionally clean & tidy. I am a nervous patient. I'm very needle phobic, especially when it comes to dental injections, this probably means it takes longer to treat me if injections are needed, like for the crown I have just had done, but I never feel a problem. I would definitely recommend my dentist to friends & family if they were looking for a practice.", "stars": 4, "review_id": 12152}
{"category": "Money & Insurance", "title": "I tried to change my contact no but it…", "review": "I tried to change my contact no but it wouldn't allow me to do so", "stars": 2, "review_id": 54922}
{"category": "Electronics & Technology", "title": "Bought ghd platinum plus hair…", "review": "Bought ghd platinum plus hair staightners, it was advertised that I would receive a free brush with the purchase. Although when the item turned up I did not receive the brush. I contacted ghd and they advised this was because I used a discount code at the checkout and I should have checked the t&c's. It is more expensive to buy direct from GHD and for me the incentive was the free item, knowing this is not possible it would have been better to make the purchase from a diffrent retailer. ", "stars": 2, "review_id": 29933}
{"category": "Legal Services & Government", "title": "I had a call from Tauheed and now…", "review": "I had a call from Tauheed and now Aliesha Edwards They both seemed to helpful and understanding,seems they are confident in what they specialise Let’s see I am submitting my case to them ,will review after the outcome of my case ", "stars": 4, "review_id": 102576}
{"category": "Sports", "title": "OBO OGO pads", "review": "I bought OBO OGO hockey pads a week ago. OBO is a good solid make but they don't make the pads solid and hard wearing, like it use to be, 23yrs ago. I've had my 'old' OBO pads for 23yrs plus, and still use it for hockey. It's a very solid padding and slight heavier than the one I just bought, which is very light weight and not as hard wearing. A bit disappointed in the making of OBO pads, but OBO kits are still the best, if you know what I mean?", "stars": 4, "review_id": 23404}
{"category": "Education & Training", "title": "Rocksteady is NOT music lessons", "review": "My son has been going to Rocksteady as a drummer since September, and we have just cancelled at the end of his first term. To summarise my review; Rocksteady is not music tuition - and anyone who is serious about their child learning to play an instrument should look elsewhere.The key thing with Rocksteady is that they are NOT music lessons. Going in to the experience, I wondered how they would teach up to 9 (!) children 5 different instruments at the same time. I looked on their website for any information and couldn't find anything. Presumably because they don't.My son plays drums and, as a guitarist with over 20 years experience, I was appalled to see a complete lack of musical education.Before he began with Rocksteady, he had been able to self-teach (with my help) many of the basics, that I would expect to be in the first lesson or with a drum teacher. That basic groove was all that was taught in the first term at Rocksteady, and without the actual music education (in terms of theory etc) to support it.But worse than the absolute snail pace that they teach at; is that they miss critical lessons for how to play the instruments. For example, aside from my son, every drummer at the performance was holding their sticks incorrectly, and nearly every single drummer was holding the stick into the drum head at the end of each stroke. These are 2 terrible bad habits for drummers that can take a long to correct, make playing harder, and introduces unnecessary physical strain on the wrist.My son did enjoy his lessons to begin with, but very quickly was becoming frustrated each week at having to sit through lessons that were far below his ability. He tells me he raised it with his bandleader on a few occasions and was dismissed each time.", "stars": 1, "review_id": 96971}
{"category": "Legal Services & Government", "title": "Not a great experience", "review": "It was too easy to hide behind the rules and not fight for me, the Customer. Claim outcome £495+ 6 lots of physio! Would have cost ten times that for the damage to the car and the hire car? The car that hit me would have been a write off and the driver some personal damage, but it was an easy win to fob me off, despite my request for escalation. Insurance company soon side stepped as well ! Not a great experience!!!!!", "stars": 3, "review_id": 102801}
{"category": "Events & Entertainment", "title": "Process of buying tickets was good but…", "review": "Process of buying tickets was good but the service charge per ticket was high, don’t mind a service charge but it shouldn’t be per ticket when being bought in one payment.", "stars": 3, "review_id": 108306}
{"category": "Food, Beverages & Tobacco", "title": "Found it very easy to order online.", "review": "Found it very easy to order online, hamper was delivered on time by being left in covered porch.  Product was of good quality and very reasonable price. Person(s) receiving the gift appreciated and enjoyed the contents of the hamper.  Have used Rington's in the past and will do so again when the need we need to send a gift.  Thank you for excellent service.", "stars": 5, "review_id": 38272}
{"category": "Animals & Pets", "title": "As good as people say it is", "review": "Very quick delivery, easy website to navigate.  I have a Cypriot 'Bitza' who will pick things up in the woods and deposit the end result in the kitchen.  Found this needs to be mixed with extra liquid even though she's on wet food but it seems to have done the job, twice now!", "stars": 4, "review_id": 2384}
{"category": "Public & Local Services", "title": "Rachel is awesome", "review": "it is a pleasure to work with smart professionals", "stars": 3, "review_id": 87848}
{"category": "Food, Beverages & Tobacco", "title": "In order to cancel a subscription", "review": "In order to cancel a subscription - you have to phone. This isn’t a simple two second call; it’s waiting for 10 minutes and then being asked 1,000 times if you are really sure you want to cancel.It’s hate this form of customer service. ", "stars": 2, "review_id": 37128}
{"category": "Travel & Vacation", "title": "The cost is high but efficiency worth…", "review": "The cost is high but efficiency worth the extra bug", "stars": 2, "review_id": 59739}
{"category": "Travel & Vacation", "title": "absoluteley awfull company would never…", "review": "absoluteley awfull company would never ever use them again or would i recomend them to my worst enemy we wanted to change our return flight due to personal circumstances there was a £13.00 difference and they wanted approximately £700.00 then we got targeted by fraudsters impersonating them and nearly lost £2000.00 so we needed to cancel the whole trip as all our personal and holiday information was stolen by them and they refused to refund our money absolutley disgusting and no help at all from them they have put us through hell", "stars": 1, "review_id": 62305}
{"category": "Media & Publishing", "title": "Great product and if was cheaper then…", "review": "Great product and it was cheaper then everyone else fast delivery my daughter loves it thanks ", "stars": 5, "review_id": 86589}
{"category": "Utilities", "title": "Shambles.", "review": "I was with isupplyenergy last year for 6 months in a rented property and the service was awful.From the get-go, their difficult-to-use website and payment system were confusing and the charges they laid out were unclear.Not only was it a mission to submit meter readings - pictures required to be sent via email for validaton - their meter reading validation team sometimes took up to 3 months to validate the readings and correct the overpayments made on the account!Once we'd vacated the property and ended our service with isupply in December 2019, we were pleased to receive a final bill with interest in our favour and thought \"well we're not going to use them again, but we're glad for this outcome\"....Until April the following year where I started receiving \"you have an unread message\" from isupplyenergy notifications and started receiving calls saying I owed money on the final bill - the final bill that I thought had been issued 4 months prior and stated we were due a refund on overpayments.I went onto their customer portal to see that all of the online statements had been rewritten with a reissue date of April 2020 and we were now owing money.As it panned out, after many calls discussing the unclear billing system, they had issued a wrong final bill in December and we did indeed owe money. We paid the new bill, and finally washed our hands of it- but with a bad opinion of how poorly run this company is. Will not recommend. I would give one star, but I can't fault how kind and patient the customer service call center was during this shambolic encounter.", "stars": 2, "review_id": 73329}
{"category": "Utilities", "title": "Appalling Customer Service", "review": "No response to emails, refusing to process complaints.Living on the fact that they have a monopoly, to do nothing.It is a shame that the great job of the field staff, is being destroyed by the bunch of total incompetent in the contact center.", "stars": 2, "review_id": 74461}
{"category": "Health & Medical", "title": "Long wait times", "review": "Doctor was great once we actually got to her but it was a long wait time.", "stars": 3, "review_id": 13875}
{"category": "Utilities", "title": "The advisor worked well with my query…", "review": "The advisor worked well with my query and although they followed/ script/policy they addressed my needs.The chatbot needs a noise/sound when an advisor joins - I missed a number of chats as I was busy in other parts of my system and wasn't alerted.", "stars": 4, "review_id": 74006}
{"category": "Money & Insurance", "title": "I hadn't had any problems withdrawing…", "review": "I hadn't had any problems withdrawing my tokens and they were usually reflected in my bank account within a few minutes. It's been two days and I haven't received ANY deposit.", "stars": 1, "review_id": 58252}
{"category": "Legal Services & Government", "title": "Thank you Mathew Nash and Team!", "review": "Massive thank you to Mathew Nash, Natalie Carter and Natalie Redfearn. If I was reviewing Mathew and his team alone it would be a resounding 5* with no faults to mention.I had a 3 year personal injury claim from 11th June 2021, that prior to Mathew and his team being assigned the case had become a burden with a lot of unanswered chasing and long periods of no contact. HOWEVER, after this point; contact was fantastic, updates were informative and if anything, I felt that it was myself letting the side down with slack responses at times. A true sense of trust was built from the very first introductory call with Mathew and I really felt you understood my best interests and eased any concerns. All three of you were truly fantastic! Through the work you, and you three alone put in; I was able to settle my claim, happy with the outcome and can finally begin to put it all behind me. Thank you once again, highly recommended. ", "stars": 4, "review_id": 102782}
{"category": "Utilities", "title": "Microgeneration price changed without informing me about it", "review": "They have changed the microgeneration prices from 24c to 19c without informing me in any way. I lost many hundreds of euro during the summer because of this lack if transparency. I found out when I called them to renew. DO NOT trust them! They will get you with good offers then change them without informing you. ", "stars": 1, "review_id": 74941}
{"category": "Food, Beverages & Tobacco", "title": "Good company", "review": "I like that I can order online & the prices are good. I was eligible for free postage because I spent the amount to allow this. I have ordered from this company before & the goods have arrived fairly quickly so this was another reason for my re ordering. The reason I have given 4 stars is because my order was despatched with an item short & I'm currently waiting for a reply.", "stars": 4, "review_id": 36185}
{"category": "Home & Garden", "title": "Low quality courier", "review": "This is the first time, I've used your site. Although the price was good. I  rate you with 1x star, due to poor shipping feature.I wasn't home when it was delivered. Your courier didn't want to wait even a minute (60sec) the time I usually need to answer the courier thru the video doorbell. The courier rang the door bell, and after 46 sec, he left, whithout leaving any notice.So now, I have no idea where is my parcel? Either is been sent back to the seller or it is in the drop shop or at my neighbours.For such service One stat is a plenty!", "stars": 1, "review_id": 69668}
{"category": "Sports", "title": "After I ordered online I received a…", "review": "After I ordered online I received a email saying when the product left the warehouse that night I would receive a tracking number.  So I emailed and asked about the tracking number and then was told I should receive before Christmas.", "stars": 3, "review_id": 11262}
{"category": "Travel & Vacation", "title": "Liars", "review": "LiarsFlight EZY2554 from GVA to LTN departed at 22:35 (vs. 21:05 planned) departure time is mysteriously published as 21:45. I don't even care about the compensation but i hate liars more than anything. This is a mediocre airline made worse by its usual lying to its clients.", "stars": 1, "review_id": 60043}
{"category": "Beauty & Well-being", "title": "The tablets arrived very fast", "review": "The tablets arrived very fast Excellent company to order from Thank you", "stars": 1, "review_id": 3184}
{"category": "Business Services", "title": "I opened a case more than 48 hours ago…", "review": "I opened a case more than 48 hours ago and you still have not replied to my problem. Also the 24/7 available chat support is just a lied... using a really really bad bot and calling it chat support is just not good enough. And when trying to reach you through phone, you say that it is unavailable but dont explain why, just hangs up. I have a withdrawal to my SOL wallet that just never came, and you refuse to give any transaction ID or hash number, so I cannot see my transaction on the blockchain. Im missing 399,84 NOK in withdraw that you guys have not sent me yet!", "stars": 1, "review_id": 45214}
{"category": "Animals & Pets", "title": "Katkin to the rescue…..", "review": "Katkin has changed my elderly toothless rescue cat from a bedraggled sorry sight into a beautiful animal with glossy fur and with a cheeky side to him. This was after obviously not enjoying normal cat food. It seemed strange to us that this was the case, but Katkin obviously tickled his taste buds and he devours it at speed, with fantastic results. Thank you Katkin…", "stars": 5, "review_id": 20095}
{"category": "Electronics & Technology", "title": "The part was fine but the delivery time…", "review": "The part was fine but the delivery time was a bit disappointing for such a small part. It took a week from the email saying they were preparing the delivery to another saying they had dispatched it. I was just about to try and contact them to ask what the delay was.", "stars": 3, "review_id": 30003}
{"category": "Money & Insurance", "title": "Caitlin was amazing", "review": "Caitlin was amazing, patient. We requested for viewing for the sexond time, still she showed us the whole property and aminities again.", "stars": 4, "review_id": 121506}
{"category": "Health & Medical", "title": "Service completely unreliable", "review": "Service completely unreliable. If you cancel with less than 24h you are being charged £30, while your cleaners can cancel at any time. Mine canceled 30’ before and messed up my whole day and had to reschedule everything. Got a £10 voucher in return, which is nice, but not even close to compensating all the trouble", "stars": 2, "review_id": 40285}
{"category": "Media & Publishing", "title": "Not satisfied with customer service", "review": "Not satisfied with customer service Paid in full for annual subscription but don’t get many channels, hardly get any response", "stars": 2, "review_id": 83804}
{"category": "Education & Training", "title": "Racist instructor?", "review": "The course content and delivery was fine - it's preferable to do the course over taking the points. It's a long session though and may be more effective with more than just one 15 minute break. However my instructor constantly got my name wrong, despite it being pronounced as it's spelt. I took the time to help her pronounce it properly at the beginning of the call yet she kept getting it wrong. A quick google head of the call would have showed her a video explaining how to pronounce it properly. She kept getting the only other Asian person's name wrong too. At best it came off as rude, at worst racist. Racism is not a good look for the Met police. Please try harder Jackie. ", "stars": 1, "review_id": 91921}
{"category": "Money & Insurance", "title": "Easy site to use", "review": "Easy site to use. A Financial Advisor contacted me and I was very happy how he could assist in dealing with my pension. However ,the cost for advice was very,very expensive,until he offered a lower quote which I finally accepted. In hindsight,I would have searched for a local Advisor and obtained more quotes to compare costs.A local advisor would have been more convenient. I am at the initial stage of obtaining a pension and so far am happy with the service provided. I strongly recommend using \"Unbiased\" as you can be sure of obtaining a genuine financial advisor.", "stars": 4, "review_id": 55580}
{"category": "Shopping & Fashion", "title": "I cannot recommend BQWatches", "review": "I find this review hard to write, as my dealing with BQWatches was traumatic from start to finish, and there should be a requirement for no star option, as the review can only be awarded zero stars. Firstly when BQ Watches approached me after watchmaster was forced to declare insolvency. When I was contacted by BQ Watches I was informed that they was an outstanding balance on my account £250 and that this amount had to be settled before the watch could be returned.I have sold various watches through watchmaster and in all my dealing with watchmaster I have never had a outstanding balance on my account.  In short watchmaster would make sure that the watch was sold before any service was carried out on the watch.Therefore I can only assume that this was a ploy on BQWatches to extract an additional income from prospective newly acquired customers from untimely demise of watchmaster. In all my dealing with the consultant from BQWatches, I found them  to be extremely unprofessional and inept in all the dealing I received from them. Indeed I felt I was bullied by BQWatches consultant to sell my watch via there platform. Eventually I received my watch back after 3 months.I cannot recommend the BQWatches to anyone as I found them to be totally unprofessional and completely inept all the dealing I had with them.", "stars": 1, "review_id": 22788}
{"category": "Construction & Manufacturing", "title": "Quick and efficient service.", "review": "Quick and efficient service.  Best price in NI.  No hassle at all.", "stars": 5, "review_id": 69458}
{"category": "Events & Entertainment", "title": "WGT - The best Ticket Agency!", "review": "The people at WGT are helpful and professional. They are extremely quick to respond to queries, and they even answer the phone! I have never experienced this level of customer service with any other company of this kind", "stars": 5, "review_id": 108171}
{"category": "Travel & Vacation", "title": "Researched an hotel recently which came…", "review": "Researched an hotel recently which came up at £290 for the weekend,went back on to book and found it had up to £358, I can't see why the price had gone up,so I refused to book it, I think it is disgusting, Laurence Wright ", "stars": 3, "review_id": 63044}
{"category": "Money & Insurance", "title": "A knowing Team ", "review": "On the whole easy to work with Zopa. little chance of aggravation due to their due diligence making sure the customer doesnt slip into the red with no chance of a quick turn around. They inform you to watch out you are at risk of taking on a debt you might not be able to cover. They ask direct questions   \"you are this, can you manage that\" ? Or  your borrowing chances have not improved or have not changed, or something like that which means take a moment if you are thinking of borrowing. ", "stars": 4, "review_id": 57245}
{"category": "Home Services", "title": "Unreliable and cheap", "review": "Whenever they mess up, and recently they have a lot, they offer zero compensation. Recently, a cleaner didn't clean anything at all and I was offered a few quid to do the job myself. Today, the cleaner skipped on me, 15 'minutes before arrival. All they offered red was to reschedule the clean.", "stars": 1, "review_id": 42789}
{"category": "Education & Training", "title": "Absolutely useless", "review": "Absolutely useless. Don't bother if you have a normal job because there is no way to interact with Drive Johnsons other than through a phone line which they never pick up on. Impossible to book lessons after having already paid for the hours yet to be used!!", "stars": 1, "review_id": 97383}
{"category": "Shopping & Fashion", "title": "Wrong item received", "review": "Wrong item received, poor communication from them until I wrote a bad review on here. Just had a email from them to say they are sending correct item out. Upgraded my review to 3 stars", "stars": 3, "review_id": 18281}
{"category": "Food, Beverages & Tobacco", "title": "Not the best experience ", "review": "Cookie was squashed. DHL left it outside in the rain on its side when it stated to lay flat. Come on Sunday when it wasn’t supposed to come until Monday", "stars": 3, "review_id": 35295}
{"category": "Health & Medical", "title": "Clunky website", "review": "Clunky website. Could not register with unusual email extension. Too prescriptive about password characters (only some not all symbols, which doesn't play well with password managers). Poor handling of unwanted cookies. No auto-updating of NHS record for vaccinations ", "stars": 2, "review_id": 13909}
{"category": "Beauty & Well-being", "title": "Lovely item not sure about the cleaning part", "review": "Items arrived on time, the toothbrush look and feel high quality. However I don’t feel the sonic system cleans that well compared to my old toothbrush. I feel bits still stuck to my teeth and have to go around a second time so spending 4 minute every cleaning session and still don’t feel my teeth are perfectly clean. It may be my technique but that’s my impression so far. ", "stars": 3, "review_id": 13750}
{"category": "Media & Publishing", "title": "Now harder to reach payment threshold.", "review": "They have made the very high payment threshold of £12 even harder to achieve.They have reduced the number of Admin Polls by 40%  from 5 to just 3.Yes they only pay 10p but every little helps.If the have to reduce the number of admin polls by 40% they surely they could reducd the payment threshold by 40% ??????", "stars": 1, "review_id": 81814}
{"category": "Beauty & Well-being", "title": "Speedy delivery", "review": "Speedy delivery, so from agentshave I am happy. The razor on the other hand leaves much to be desired", "stars": 4, "review_id": 2870}
{"category": "Construction & Manufacturing", "title": "10 days to dispatch...", "review": "Products arrived after the event I purchased them for as the were not dispatched for 10 working days. Ended up buying another birthday gift for the intended occassion.Good correspondence with Craigmore customer services. Who responded to my emails swiftly, just a shame the delivery wasn't as efficient. Products recieved in good condition, within 48 hours of being dispatched.", "stars": 3, "review_id": 69300}
{"category": "Electronics & Technology", "title": "Great service and product", "review": "Very prompt free delivery, product as described and worked instantly upon installing and switching on.Recommended supplier!", "stars": 5, "review_id": 32793}
{"category": "Beauty & Well-being", "title": "The bars I've tried so far are…", "review": "The bars I've tried so far are delicious.  It's nice to have a treat once in a while and know I'm still working towards my protein goals. Quick delivery. Well priced. And being lactose intolerant, the pea protein is ideal. I will be buying more. ", "stars": 5, "review_id": 111786}
{"category": "Money & Insurance", "title": "Horrible experience and I can't believe…", "review": "Horrible experience and I can't believe any of the positive reviews on here. The negative ones definitely reflect my experience. From the start I've asked about their fees and what any additional payments might be. For the second time in less than a year I'm now asked to pay additional fees that I was not told about before. This time £600 for them to adjust the payroll THEY set up for me to make sure I don't get taxed too much. The whole arrangement feels like an extortion scheme and I'm getting out as fast as i can. Do not fall for this dodgy company 🫣", "stars": 1, "review_id": 55531}
{"category": "Home Services", "title": "First Class Service", "review": "After foolishly losing my key for my BMW in Bishops Stortford, and no spare to start it, I contacted Jack.  Within an hour I was back on the road!  Jack's prompt and excellent value service to make a fully programed replacement  is exceptional and I thoroughly recommend his service plus he is a great guy too!  A pleasure to experience great service!", "stars": 5, "review_id": 43305}
{"category": "Beauty & Well-being", "title": "Not very happy ", "review": "I ordered 2 items, 1 of which was the wrong item. I sent an email which has not been replied to. Not very happy . ", "stars": 3, "review_id": 4520}
{"category": "Business Services", "title": "Patient and supportive", "review": "Assure Technical gave me the time and support I needed to get our DP certification project across the line.  This having been my first time completing this task, they gave me the guidance I needed whilst being extremely patient with me when my knowledge was lacking.  Thank you for all your help.  I would highly recommend", "stars": 5, "review_id": 45258}
{"category": "Animals & Pets", "title": "Horrible experience with this company…", "review": "Horrible experience with this company yesterday at NEC. Rude and pressurised selling which does not reflect well on the company. If you want people to like the product then it is important that they like you.Also its important to give information rather than have a sole objective to get customers to sign on the dotted line.", "stars": 2, "review_id": 1603}
{"category": "Health & Medical", "title": "Still waiting on my order", "review": "Still waiting on my order that has been put on back order as it's now out of stock after I ordered it. They should let you know when ordering if they don't have it in stock.", "stars": 1, "review_id": 17440}
{"category": "Shopping & Fashion", "title": "Low stock & slow delivery. ", "review": "The range of products is quite good, but stick numbers don’t seem to be refreshed very often. I found too many instances where I was unable to bulk buy training tops for my team only because our chosen top didn’t have enough of the required sizes, or were completely out of stock. Delivery time for personalised items is too long. 6 weeks seems a bit excessive, and they didn’t provide any updates at all after the order of around £700 I’d put in. ", "stars": 3, "review_id": 117097}
{"category": "Education & Training", "title": "NCC HELP ME PLZ", "review": "Hi, I would really want to request NCC to please make the instalment plan for renewal of the course. I was in NCC student for last one year but due to some personal and financial reasons I couldn’t complete the course but I paid all my course instalments on time But when I emailed Ncc that I want to get extension to finish my course and I am happy to pay the extension FEE then they’ve told me it’s 195. You have to pay advance for 12 months. I would like to request NCC if they can make instalments. I will complete my course as PAYING 60 something every month is not affordable for me if they can help me would be great  as a genuinely want to complete. My course. I have done my best AND EVEN EMAILED THEM as well and if you can help me would be great. I would like to request you if you can help me that would be really great AND AS  from the past one year I HAVE PAID ALL INSTALLMENT ON TIME DIDNT USE MUCH OF TUTOR SUPPORT . I haven’t used more support nothing because I did STARTED THIS COURSE  thinking that I will get videos AND GET SOME PRACTICAL KNOWLEDGE and stuff of that but I didn’t get it but that’s fine because it might be my mistake that I didn’t do a proper research before joining NCC it but if you can help me at this time would be great and I will be forever thankful to you. I hope NCC team will listen. I help me to make that instalment easier for me so I can quickly pay and get into courses No message or no Response fromNCC ITS 10 JULY TODAYNo update ", "stars": 4, "review_id": 92455}
{"category": "Electronics & Technology", "title": "Mathematical textbooks can have serious legibility issues", "review": "Somewhat disappointed by the textbooks in my area of interest (mathematics and statistics). Some take a long time to load and search, and algebra is presented in tiny, virtually unreadable jpgs. UPDATE:  Perlego are taking this issue seriously, and are trying to get publishers to give them PDFs as well as ePUB versions, the former displaying mathematical content perfectly well. Ironically, the older textbooks are less likely to cause problems, as they're more often in PDF format. As Hayley at Perlego helpfully pointed out to me, equations in ePUBeditions can be made a bit more legible simply by zooming in (for example by using \"ctrl\" and \"+\")I've amended my rating accordingly. ", "stars": 3, "review_id": 94684}
{"category": "Public & Local Services", "title": "DO NOT SUBSCRIBE ", "review": "I enrolled my daughter for more than 8 months. During that time I tried to make contact with the teacher line on various occasions but no one responded. I wrote emails without any response. Until I stopped the subscription clearly stating the reason. I immediately got a call and now they are threatening me legal action if I don't pay them another month subscription whereas I had clearly asked them to cancel. They do not care about your child's progress. They are only after money, so don't enrol and waste your money. They will not respond to you until you stop subscription. I can't believe they are teachers!DO NOT USE THEM. THEY ARE FRAUD AND ONLY HAVE ONLINE WORK WITHOUT ANY SUPPORT!", "stars": 1, "review_id": 112975}
{"category": "Sports", "title": "Lack of planning", "review": "A group of us attended an evening with Dominic Herbertson and Davey Todd. The evening started well, with good food and conversation with Dominic and the host. Davey arrived a little late, which didn’t dampen the evening too much. However, as the evening reached a point where audience questions were to be answered, everyone in the building of the hotel had to be evacuated. I realise that this is completely out of the control of Duke…however this incident highlighted that there had been no contingency planning in place. It turned out to be a false alarm which is just as well - because no formal‘house keeping’ had been presented at the beginning of the evening and a clear lack of understanding of procedure thereafter was evident. The best that Duke could come up with was to have a photo with the fire engine before re-entering the building to so that the host could sell his book and Dom and Davey on hand to sign a few autographs at the end. Not many of the audience returned… which is largely down to the evening had effectively been ended - even though it wasn’t clear that it actually had. Had a few of the questions been answered by Dom and Davey (there was plenty of time for this) … it would have rounded off a key part of quite an expensive evening, nicely.", "stars": 2, "review_id": 22962}
{"category": "Electronics & Technology", "title": "Ottima", "review": "Ottima! Risposte immediate e download dei software con invio licenze in pochi minuti", "stars": 5, "review_id": 32650}
{"category": "Home & Garden", "title": "I had up to date emails keeping me…", "review": "I had up to date emails keeping me informed throughout the entire process, all items arrived well packed and privately too! ; ) I will be a regular buyer from this point on guys thank you! ", "stars": 5, "review_id": 70581}
{"category": "Vehicles & Transportation", "title": "Glad to find that click & collect is…", "review": "Glad to find that click & collect is back. Great for me living locally. Only problem was finding your premises as there aren't any obvious signs outside!  Now I know where you are it’s a doddle!Staff were friendly, a guy just leaving to go home on his bike helped me. Thank you. ", "stars": 5, "review_id": 76513}
{"category": "Travel & Vacation", "title": "Applied for a turkey e visa and…", "review": "Applied for a turkey e visa and received the visa on the same day. Any questions we had were answered straight away. Definitely recommend ", "stars": 5, "review_id": 101961}
{"category": "Home Services", "title": "Friendly, Skilled and Diligent", "review": "I am a disabled person and required support with an unusual electrics tasks, Richard the Electrician that Handy Experts sent was brilliant, friendly, knowledgeable and persistent. He came back multiple times to get the task completed in exactly the way I needed it and it was far from straightforward. I really appreciated the persistence, skill and care he applied to the job. Handy Experts communicated clearly and quickly. ", "stars": 5, "review_id": 43105}
{"category": "Business Services", "title": "Bought my Ford from Lloyds Motor Group…", "review": "Bought my Ford from Lloyds Motor Group and I am very happy with it. Car is very good condition, clean. Everything went smoothly. Quick response, very informative, excellent communication. Really happy with my new car and the service. ", "stars": 5, "review_id": 46635}
{"category": "Business Services", "title": "Hi it would have been nice if they…", "review": "Hi it would have been nice if they could have delivered them to the house rather than throwing them under a box and not even letting us know ", "stars": 1, "review_id": 68092}
{"category": "Beauty & Well-being", "title": "Delivery was very poor.When I order I…", "review": "Delivery was very poor.When I order I was offered next day delivery on a promotion,my daughter stayed in waiting.Delivery was 4 days later,very poor.", "stars": 2, "review_id": 5545}
{"category": "Media & Publishing", "title": "DO NOT USE GET ME IN UNDER ANY…", "review": "DO NOT USE GET ME IN UNDER ANY CIRCUMSTANCES.I recently agreed to purchase 2 x tickets for the \"International Pits Straight\" at the British Grand Prix. My tickets turned up, but they were for the significantly inferior \"National Pits Straight\".Trying to contact Get me in by phone or email has proved to be impossible.", "stars": 1, "review_id": 84235}
{"category": "Media & Publishing", "title": "Once again its Christmas time", "review": "Once again its Christmas time, repeats from shows donkeys years ago and other rubbish. How dare you charge for a television licence, it all needs to change. Don't they think we are sick and tired of Morecombe and Wise year after year and all the other out of date programmes. ", "stars": 1, "review_id": 83442}
{"category": "Utilities", "title": "Not all its cracked up to be service wise worse that British Gas and that’s an achievement ", "review": "Switched to Intelligent EV tarrif after switching suppliers. I've been unable to perform a test charge and following 3 weeks of calls to their support team, no one returned the call as promised. Still unable to use the service and have the service control charger. Really poor customer service and call centre opening hours are poor 9-5 Mon-Fri in this day is shocking. The mobile app has loads of bugs in it with dead links that do not work or provide any feedback as to errorsWonder if it was worth switching :( ", "stars": 1, "review_id": 73660}
{"category": "Vehicles & Transportation", "title": "Always had v good service", "review": "Always had v good service. 1 problem today on website. When I tried to use first online system of registration number + post code it said my post code was invalid whether I used a space or not.", "stars": 4, "review_id": 77574}
{"category": "Health & Medical", "title": "I'm still waiting for two toothbrushes…", "review": "I'm still waiting for two toothbrushes that l ordered in October.", "stars": 1, "review_id": 14054}
{"category": "Food, Beverages & Tobacco", "title": "Vey quick service and competitively…", "review": "Vey quick service and competitively priced beer. Good website too. Very impressed. Only slight issue is high price of a delivery.", "stars": 4, "review_id": 110663}
{"category": "Education & Training", "title": "Great help and assistance on enrolment…", "review": "Great help and assistance on enrolment from LaibaKeen to get started so just waiting for my login details and course materials. Hoping for a great learning experience. ", "stars": 4, "review_id": 94128}
{"category": "Home Services", "title": "Just the job", "review": "The understairs rack is ideal for our ‘overflow’ from the wine cabinet. Also, it puts the reds in easy reach from the dining table.", "stars": 4, "review_id": 112033}
{"category": "Hobbies & Crafts", "title": "Quick delivery and item as described.", "review": "Quick delivery and item as described.Cheaper than anywhere else.Very happy", "stars": 5, "review_id": 15081}
{"category": "Construction & Manufacturing", "title": "I purchased the jug with 3 filters", "review": "I purchased the jug with 3 filters. I contacted the company after my readings were not 000 this was within the first month of purchase. I was told to check the seal and try another filter if no better. I have checked the seal it's fitted properly and my readings are 59 but the smell is awful like TCP antiseptic. I purchased 3 filers and annoyed I have had to use another within one month of purchase at my expense and still do not have a 0 reading but 59 along with the awful smell. I have emailed zero water with pictures. Not happy at all my last jug and filters with water drop never smelt bad like these do.", "stars": 1, "review_id": 66582}
{"category": "Home Services", "title": "Really impressed by HandyExperts", "review": "Really impressed by HandyExperts.  Will definitely use again.  Our electrician was efficient and careful in his work.  He made sure that the work was exactly as I wanted.  Will definitely use again. ", "stars": 5, "review_id": 43104}
{"category": "Shopping & Fashion", "title": "Still Waiting For Delivery ", "review": "My order was despatched from your store/warehouse on the 2nd of December via your courier Global-e. As at today (15December) I have yet to receive any tracking information and there  is no indication as to when it will be processed let alone delivered. I would like to now cancel the order and request a full refund.Thank you.Bill Holland ", "stars": 2, "review_id": 9677}
{"category": "Food, Beverages & Tobacco", "title": "Christmas  Meal", "review": "Hi. The meal was very nice especially the prepared veg and gravy but the Turkey was disappointing. We will mix and match next Xmas and get a fresh turkey somewhere else.  Portion size was very good. ", "stars": 3, "review_id": 35697}
{"category": "Media & Publishing", "title": "The monitor speakers were fine and came…", "review": "The monitor speakers were fine and came well packaged and undamaged. However, the supplied cables were no good for plugging into my focusrite scarlett. The cable had a SLR end on both ends. It should have been a TRS connection at the audio interface end. Maybe my own fault for not checking thoroughly enough. I bought suitable cables elsewhere. Other than that ..... happy.", "stars": 3, "review_id": 84483}
{"category": "Sports", "title": "Very helpful and excellent value", "review": "Ordered a sample pack which royal mail lost. Contacted the staff who were very helpful and replacement was sent out without and fuss.Now ordered a few bits and the order was packed brilliantly and arrived without any issues and the prices are excellent, very good value for money. Have no hesitations to recommend and will definitely use them again", "stars": 5, "review_id": 110177}
{"category": "Construction & Manufacturing", "title": "This time Kane deserve 5 stars ", "review": "When I originally purchased the 458s analyser in 2022 I had problems with the unit which had to go back twice which I wasn't happy about.This is the second time I've sent the unit back for calibration. I have to give Kane 5 stars as the service has been great with no problems.Each time my Analyser has been serviced / calibrated and returned to me within the specified time period.", "stars": 5, "review_id": 67052}
{"category": "Public & Local Services", "title": "Unsatisfied from the service. ", "review": "Hi,  ORDER # 1303142-1271950First, I have received a late response for the service and the final document.Second, Luckily I had a review for the document by another company and they have highlighted 9 issues on the document.Third, I have emailed 3 different persons from TopCV as mentioned below to rectify and solve this matter. And I did not received any response from any one yet. 1- Ms. Katie Warren - TopCV CV Expert.2 - Mr. John - TopCV Customer Care.3 - Mr. Craig A - TopCV CV Writer.Kindly I need the feedback and solution on this matter. Thank you. ", "stars": 2, "review_id": 87496}
{"category": "Health & Medical", "title": "Good service but didn’t deliver as paid for ", "review": "Good service but I paid for next day delivery which was a Saturday and the medication eventually arrived on the Thursday of the following week. I did contact them but yet to have a response and that was nearly two weeks ago.", "stars": 3, "review_id": 115330}
{"category": "Restaurants & Bars", "title": "See Update", "review": "Product not packed properly and some glasses broken. Emailed them twice and they never had the courtesy to even reply, other than a request to review them on Trustpilot. UPDATE: after the Trustpilot review, they’ve now responded and are sending replacements.", "stars": 3, "review_id": 54069}
{"category": "Business Services", "title": "Great experience ", "review": "This was my first time registering a Company in the UK and I had a great experience with Companies Made Simple. Even though it took a while but the customer service team was very patient with me in explaining all the requirements. I had a great experience and I would highly recommend the company. ", "stars": 5, "review_id": 44127}
{"category": "Health & Medical", "title": "Helpful nurse Amour helped us do our…", "review": "Helpful nurse Amour helped us do our virtual lateral flow test", "stars": 4, "review_id": 21204}
{"category": "Travel & Vacation", "title": "---Away resort - Newquay 1/5", "review": "---**Away Resort Review: Not Quite the Escape We Expected**Our stay at Away Resort came with more challenges than anticipated. The main concerns we faced included:1. **Lack of Reception After Hours**: Once the working hours were over, there was no reception staff available to assist with any queries or issues that arose.2. **No Emergency Contact**: In case of emergencies such as power outages or lack of hot water, there was no one to contact for immediate help. This lack of support was quite alarming.3. **Poor Network Connectivity**: The network connectivity was almost non-existent, which meant no light, no Wi-Fi. This significantly affected our ability to communicate and stay connected.Overall, these issues turned our supposedly relaxing getaway into a rather stressful experience. Improvements in these areas would greatly enhance the comfort and convenience of future guests.---I hope this captures your experience effectively. Let me know if there's anything you'd like to add or modify!", "stars": 1, "review_id": 62577}
{"category": "Media & Publishing", "title": "So, no delivery to The States now, Photobox?", "review": "Have been using Photobox for my calendars since 2009 and have always been very satisfied with your products.However, this year there have been a couple of disappointing experiences.Firstly, I have always sent a calendar to my son and family in The States. It wasn't until I was already committed to my collection of 5 calendars that I discovered you no longer ship to The States. Due to time constraints, I had to resort to sending it by Royal Mail which was both very expensive as well as much slower. I also paid £7 for the fastest delivery to my address of the calendar for the U.S but this also ended up being no quicker than the usual delivery - I am aware you may say this is outwith your control up to a point.So, unfortunately, if the same restriction on US delivery prevails going forward, I would need to seek out another company to do my calendars which would be a pity as your products are always very good.I think at the very least this change in U.S delivery policy ought to have been highlighted clearly on your website.", "stars": 4, "review_id": 85065}
{"category": "Shopping & Fashion", "title": "Good delivery and easy returns through…", "review": "Good delivery and easy returns through post office. Unfortunately the sandals I ordered were enormous, far too big round the straps so had to return them. ", "stars": 3, "review_id": 22295}
{"category": "Beauty & Well-being", "title": "Really love my deep sea spa majik and…", "review": "Really love my deep sea spa majik and am a regular customer, but i feel the website could do with an overhaul.", "stars": 3, "review_id": 5417}
{"category": "Education & Training", "title": "Great Evening", "review": "The 2024 IoSCM Awards was very well organised. I found it inspiring. It was great to see everyone celebrated for their hard work and achievements. The event ran smoothly, with a great atmosphere. Looking forward to next year!", "stars": 5, "review_id": 95075}
{"category": "Utilities", "title": "Think twice before joining", "review": "My fourth/fifth call to Utilita that has lasted over an hour since joining in Oct 24. I’ve never had a working home display meter, I’m on my second hub now - still not connecting to Utilita network. I have been incorrectly requested to provide a copy of my tenancy agreement when it’s not required in my circumstances. My services were cut off a week after installation despite my engineer ensuring that they wouldn’t while I waited for my top up card. Poor communication throughout my experiences, Utilita have been nothing but complicated. Customer advisors are very friendly and helpful, but nothing is ever truly resolved . This isn’t the service I expected, particularly for your priority service customers with disabilities. ", "stars": 2, "review_id": 74130}
{"category": "Restaurants & Bars", "title": "Fast delivery and excellent packaging", "review": "Fast delivery and excellent packaging. Love these high quality products ", "stars": 5, "review_id": 49989}
{"category": "Construction & Manufacturing", "title": "2 years old batery ", "review": "Ordered 2 9 Ah Dewalt batery received 2 years old ones.  Everyone knows how much performance a batery loses if it's unused for 2 years.!!!Contact them and agreed to arrange a replacement or refund,  still nothing one week after . Very disappointed.", "stars": 2, "review_id": 66453}
{"category": "Vehicles & Transportation", "title": "I booked appointment for a tire change", "review": "I booked appointment for a tire change, I arrived on time, the gentleman said they hadn't received my tires from etires yet, only an email with confirmationI came to the Workshop again after 3 days After picking up the car, I noticed that the tires were of a different brand than the one I ordered. the gentleman from the workshop said that the etires company sent him theseI contacted etires but without result they are not responsible for this incidentNEVER NEVER NEVER AGAIN THIS COMPANY!!!!!!!!!!", "stars": 1, "review_id": 80814}
{"category": "Business Services", "title": "Simple, straightforward, fast!", "review": "Simple template to store your filed return, complete that, upload and it's done. By using a separate sheet, your forced to create a fixed file for your records, which is genius.", "stars": 5, "review_id": 47778}
